<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sk" lang="sk"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114861"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Pr%C3%A1vne%20upozornenia%20spolo%C4%8Dnosti%20Oracle"></a><title>Pr&aacute;vne upozornenia spoločnosti Oracle</title>
<link rel="stylesheet" href="../css/blafdoc.css" type="text/css"/>
</head>
<body>
<h1>Pr&aacute;vne upozornenia spoločnosti Oracle</h1>

<h2>Upozornenie o autorsk&yacute;ch pr&aacute;vach</h2>
<p>Copyright &copy; 1994-2016, spoločnosť Oracle a/alebo jej pobočky. V&scaron;etky pr&aacute;va vyhraden&eacute;.</p>

<h2>Obmedzenia licencie a odmietnutie z&aacute;ruk/n&aacute;sledn&yacute;ch &scaron;k&ocirc;d</h2>
<p>Tento softv&eacute;r a pr&iacute;slu&scaron;n&aacute; dokument&aacute;cia sa poskytuj&uacute; na z&aacute;klade licenčnej zmluvy, ktor&aacute; obsahuje obmedzenia vzťahuj&uacute;ce sa na použ&iacute;vanie a zverejňovanie, a s&uacute; chr&aacute;nen&eacute; z&aacute;konmi o du&scaron;evnom vlastn&iacute;ctve. Softv&eacute;r, dokument&aacute;cia ani žiadna ich časť sa nesm&uacute; použ&iacute;vať, kop&iacute;rovať, reprodukovať, prekladať, vysielať, modifikovať, licencovať, pren&aacute;&scaron;ať, distribuovať, vystavovať, vykon&aacute;vať, publikovať ani predv&aacute;dzať v žiadnej forme ani žiadnym sp&ocirc;sobom, okrem pr&iacute;padov v&yacute;slovne uveden&yacute;ch v licenčnej zmluve alebo povolen&yacute;ch z&aacute;konom. Sp&auml;tn&yacute; rozklad, disasemblovanie a dekompilovanie softv&eacute;ru s&uacute; zak&aacute;zan&eacute;; povolen&eacute; s&uacute; len v pr&iacute;padoch potrebn&yacute;ch na zabezpečenie spolupr&aacute;ce s in&yacute;m softv&eacute;rom, ak to vyžaduje z&aacute;kon.</p>

<h2>Odmietnutie z&aacute;ruky</h2>
<p>Inform&aacute;cie tu uveden&eacute; sa m&ocirc;žu zmeniť bez predch&aacute;dzaj&uacute;ceho upozornenia a neposkytuje sa z&aacute;ruka na ich bezchybnosť. Ak objav&iacute;te chybu, upozornite n&aacute;s, pros&iacute;m, p&iacute;somnou formou.</p>

<h2>Upozornenie o obmedzen&yacute;ch pr&aacute;vach</h2>
<p>Ak sa tento softv&eacute;r alebo pr&iacute;slu&scaron;n&aacute; dokument&aacute;cia dod&aacute;vaj&uacute; &scaron;t&aacute;tnym org&aacute;nom Spojen&yacute;ch &scaron;t&aacute;tov americk&yacute;ch alebo osob&aacute;m, ktor&eacute; z&iacute;skavaj&uacute; licenciu alebo použ&iacute;vaj&uacute; softv&eacute;r a pr&iacute;slu&scaron;n&uacute; dokument&aacute;ciu v mene &scaron;t&aacute;tnych org&aacute;nov Spojen&yacute;ch &scaron;t&aacute;tov americk&yacute;ch, plat&iacute; nasleduj&uacute;ce upozornenie:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Upozornenie o použ&iacute;van&iacute; v nebezpečn&yacute;ch aplik&aacute;ci&aacute;ch</h2>
<p>Softv&eacute;r/hardv&eacute;r je určen&yacute; na v&scaron;eobecn&eacute; použitie v r&aacute;mci rozličn&yacute;ch aplik&aacute;ci&iacute; na spr&aacute;vu inform&aacute;ci&iacute;. Nie je vytvoren&yacute; ani určen&yacute; na použitie v r&aacute;mci potenci&aacute;lne nebezpečn&yacute;ch aplik&aacute;ci&iacute; vr&aacute;tane aplik&aacute;ci&iacute;, ktor&eacute; m&ocirc;žu predstavovať riziko zranenia os&ocirc;b. Ak budete použ&iacute;vať softv&eacute;r alebo hardv&eacute;r v r&aacute;mci nebezpečn&yacute;ch aplik&aacute;ci&iacute;, mus&iacute;te na vlastn&uacute; zodpovednosť prijať v&scaron;etky opatrenia potrebn&eacute; na ochranu pred zlyhan&iacute;m, z&aacute;lohovanie, redundantnosť a ďal&scaron;ie opatrenia potrebn&eacute; na zaistenie bezpečn&eacute;ho využ&iacute;vania tak&yacute;chto aplik&aacute;ci&iacute;. Spoločnosť Oracle a jej pobočky nenes&uacute; žiadnu zodpovednosť za ak&eacute;koľvek &scaron;kody sp&ocirc;soben&eacute; použ&iacute;van&iacute;m tohto softv&eacute;ru alebo hardv&eacute;ru v r&aacute;mci nebezpečn&yacute;ch aplik&aacute;ci&iacute;.</p>

<h2>Upozornenie o ochrann&yacute;ch zn&aacute;mkach</h2>
<p>Oracle a Java s&uacute; registrovan&eacute; ochrann&eacute; zn&aacute;mky spoločnosti Oracle a/alebo jej pobočiek. Ostatn&eacute; n&aacute;zvy m&ocirc;žu byť ochrann&yacute;mi zn&aacute;mkami pr&iacute;slu&scaron;n&yacute;ch vlastn&iacute;kov.</p>
<p>Intel a Intel Xeon s&uacute; ochrann&eacute; zn&aacute;mky alebo registrovan&eacute; ochrann&eacute; zn&aacute;mky spoločnosti Intel Corporation. V&scaron;etky ochrann&eacute; zn&aacute;mky SPARC sa použ&iacute;vaj&uacute; v r&aacute;mci licencie a s&uacute; ochrann&yacute;mi zn&aacute;mkami alebo registrovan&yacute;mi ochrann&yacute;mi zn&aacute;mkami spoločnosti SPARC International, Inc. AMD, Opteron, logo AMD a logo AMD Opteron s&uacute; ochrann&yacute;mi zn&aacute;mkami alebo registrovan&yacute;mi ochrann&yacute;mi zn&aacute;mkami spoločnosti Advanced Micro Devices. UNIX je registrovan&aacute; ochrann&aacute; zn&aacute;mka konzorcia The Open Group.</p>

<h2>Odmietnutie z&aacute;ruk za obsah, produkty a služby tret&iacute;ch str&aacute;n</h2>
<p>Tento softv&eacute;r, hardv&eacute;r a dokument&aacute;cia m&ocirc;žu poskytovať pr&iacute;stup k obsahu, produktom a služb&aacute;m tret&iacute;ch str&aacute;n alebo inform&aacute;cie o nich. Spoločnosť Oracle Corporation a jej pobočky nenes&uacute; zodpovednosť a v&yacute;slovne odmietaj&uacute; ak&eacute;koľvek z&aacute;ruky vzťahuj&uacute;ce sa na obsah, produkty a služby tret&iacute;ch str&aacute;n, ak to nie je uveden&eacute; inak v pr&iacute;slu&scaron;nej zmluve medzi vami a spoločnosťou Oracle. Spoločnosť Oracle Corporation a jej pobočky nebud&uacute; zodpovedať za žiadne straty, n&aacute;klady alebo &scaron;kody, ktor&eacute; vznikn&uacute; v d&ocirc;sledku v&aacute;&scaron;ho pr&iacute;stupu a použ&iacute;vania obsahu, produktov a služieb tret&iacute;ch str&aacute;n s v&yacute;nimkou pr&iacute;padov uveden&yacute;ch v pr&iacute;slu&scaron;nej zmluve medzi vami a spoločnosťou Oracle.</p>

<h2>Upozornenie o dokument&aacute;cii v pracovn&yacute;ch verzi&aacute;ch Alfa a Beta</h2>
<p>Ak je tento dokument v predprodukčnom stave:</p>
<p>T&aacute;to dokument&aacute;cia je v predprodukčnom stave a je určen&aacute; iba na demon&scaron;tračn&eacute; a predbežn&eacute; použitie. Inform&aacute;cie obsiahnut&eacute; v tejto dokument&aacute;cii nemusia byť &scaron;pecifick&eacute; pre hardv&eacute;r, na ktorom softv&eacute;r použ&iacute;vate. Spoločnosť Oracle Corporation a jej pobočky nenes&uacute; žiadnu zodpovednosť za obsah tejto dokument&aacute;cie, v&yacute;slovne sa zriekaj&uacute; ak&yacute;chkoľvek z&aacute;ruk na t&uacute;to dokument&aacute;ciu a nezodpovedaj&uacute; za žiadne straty, n&aacute;klady ani &scaron;kody vzniknut&eacute; v d&ocirc;sledku použ&iacute;vania tejto dokument&aacute;cie.</p>

<h2>Upozornenie o dokument&aacute;cii v s&uacute;kromn&yacute;ch pracovn&yacute;ch verzi&aacute;ch Alfa a Beta</h2>
<p>Ak je tento dokument v s&uacute;kromnom predprodukčnom stave:</p>
<p>&Uacute;daje obsiahnut&eacute; v tomto dokumente maj&uacute; iba informat&iacute;vny charakter a s&uacute; určen&eacute; iba pre osoby v &uacute;lohe členov poradn&yacute;ch v&yacute;borov z&aacute;kazn&iacute;kov (Customer Advisory Board) alebo na využitie v s&uacute;lade so zmluvou o sk&uacute;&scaron;obnom programe vo f&aacute;ze beta. Nepredstavuj&uacute; z&aacute;v&auml;zok dodania materi&aacute;lu, k&oacute;du alebo funkcionality a nemožno z nich vych&aacute;dzať pri prij&iacute;man&iacute; rozhodnut&iacute; o n&aacute;kupe. V&yacute;voj, vydanie a načasovanie ktorejkoľvek z funkci&iacute; či funkcional&iacute;t pop&iacute;san&yacute;ch v tomto dokumente z&aacute;vis&iacute; v&yacute;lučne od spoločnosti Oracle.</p>
<p>Tento dokument v akejkoľvek podobe, či už elektronickej alebo tlačenej, obsahuje inform&aacute;cie, ktor&eacute; s&uacute; v&yacute;lučn&yacute;m vlastn&iacute;ctvom spoločnosti Oracle. Poskytnutie pr&iacute;stupu k tomuto d&ocirc;vern&eacute;mu materi&aacute;lu a jeho použ&iacute;vanie podlieha podmienkam a ustanoveniam r&aacute;mcovej zmluvy spoločnosti Oracle, zmluvy o poskytovan&iacute; licenci&iacute; a služieb Oracle, zmluvy o členstve v programe Oracle PartnerNetwork, distribučnej zmluvy so spoločnosťou Oracle alebo inej licenčnej zmluvy, ktor&uacute; ste uzatvorili vy a spoločnosť Oracle a zaviazali ste sa k jej dodržiavaniu. Tento dokument ani inform&aacute;cie v ňom obsiahnut&eacute; sa nesm&uacute; zverejniť, kop&iacute;rovať, reprodukovať ani distribuovať žiadnemu subjektu mimo spoločnosti Oracle bez predch&aacute;dzaj&uacute;ceho p&iacute;somn&eacute;ho s&uacute;hlasu spoločnosti Oracle. Tento dokument nie je s&uacute;časťou va&scaron;ej licenčnej zmluvy a nemožno ho začleniť do žiadnej zmluvy so spoločnosťou Oracle, jej pobočkami alebo dc&eacute;rskymi spoločnosťami.</p>

<h2>Pr&iacute;stupnosť dokument&aacute;cie</h2>
<p>Inform&aacute;cie o zjednodu&scaron;en&iacute; pr&iacute;stupu k produktom spoločnosti Oracle n&aacute;jdete na str&aacute;nke programu Oracle Accessibility <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>Pr&iacute;stup k technickej podpore spoločnosti Oracle</p>
<p>Z&aacute;kazn&iacute;ci spoločnosti Oracle, ktor&iacute; si k&uacute;pili technick&uacute; podporu, maj&uacute; pr&iacute;stup k elektronickej technickej podpore prostredn&iacute;ctvom str&aacute;nky My Oracle Support. Ďal&scaron;ie inform&aacute;cie n&aacute;jdete na str&aacute;nke <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code>. Ak ste sluchovo postihnut&iacute;, viac inform&aacute;ci&iacute; n&aacute;jdete tu: <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code>.</p>


<p><img alt="Logo spoločnosti Oracle" src="../gifs/oracle.gif"/></p>


</body></html>