<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="el" lang="el"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114823"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/%CE%9D%CE%BF%CE%BC%CE%B9%CE%BA%CE%AD%CF%82%20%CF%83%CE%B7%CE%BC%CE%B5%CE%B9%CF%8E%CF%83%CE%B5%CE%B9%CF%82%20Oracle"></a><title>&Nu;&omicron;&mu;&iota;&kappa;έ&sigmaf; &sigma;&eta;&mu;&epsilon;&iota;ώ&sigma;&epsilon;&iota;&sigmaf; Oracle</title>
<link rel="stylesheet" href="../css/blafdoc.css" type="text/css"/>
</head>
<body>
<h1>&Nu;&omicron;&mu;&iota;&kappa;έ&sigmaf; &sigma;&eta;&mu;&epsilon;&iota;ώ&sigma;&epsilon;&iota;&sigmaf; Oracle</h1>

<h2>&Sigma;&eta;&mu;&epsilon;ί&omega;&sigma;&eta; &gamma;&iota;&alpha; &tau;&alpha; &pi;&nu;&epsilon;&upsilon;&mu;&alpha;&tau;&iota;&kappa;ά &delta;&iota;&kappa;&alpha;&iota;ώ&mu;&alpha;&tau;&alpha;</h2>
<p>&Pi;&nu;&epsilon;&upsilon;&mu;&alpha;&tau;&iota;&kappa;ά &delta;&iota;&kappa;&alpha;&iota;ώ&mu;&alpha;&tau;&alpha; &copy; 1994-2016, Oracle ή/&kappa;&alpha;&iota; &theta;&upsilon;&gamma;&alpha;&tau;&rho;&iota;&kappa;ώ&nu; &epsilon;&tau;&alpha;&iota;&rho;&epsilon;&iota;ώ&nu;. &Mu;&epsilon; &tau;&eta;&nu; &epsilon;&pi;&iota;&phi;ύ&lambda;&alpha;&xi;&eta; &kappa;ά&theta;&epsilon; &nu;ό&mu;&iota;&mu;&omicron;&upsilon; &delta;&iota;&kappa;&alpha;&iota;ώ&mu;&alpha;&tau;&omicron;&sigmaf;.</p>

<h2>&Epsilon;&gamma;&gamma;ύ&eta;&sigma;&eta; &pi;&epsilon;&rho;&iota;&omicron;&rho;&iota;&sigma;&mu;ώ&nu; ά&delta;&epsilon;&iota;&alpha;&sigmaf; &chi;&rho;ή&sigma;&eta;&sigmaf;/&Alpha;&pi;&omicron;&pi;&omicron;ί&eta;&sigma;&eta; &epsilon;&upsilon;&theta;&upsilon;&nu;ώ&nu; &gamma;&iota;&alpha; &epsilon;&pi;&alpha;&kappa;ό&lambda;&omicron;&upsilon;&theta;&epsilon;&sigmaf; &zeta;&eta;&mu;ί&epsilon;&sigmaf;</h2>
<p>&Tau;&omicron; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;ό &kappa;&alpha;&iota; &eta; &sigma;&chi;&epsilon;&tau;&iota;&kappa;ή &tau;&epsilon;&kappa;&mu;&eta;&rho;ί&omega;&sigma;&eta; &pi;&alpha;&rho;έ&chi;&omicron;&nu;&tau;&alpha;&iota; &sigma;ύ&mu;&phi;&omega;&nu;&alpha; &mu;&epsilon; &tau;&omicron;&upsilon;&sigmaf; ό&rho;&omicron;&upsilon;&sigmaf; &tau;&eta;&sigmaf; ά&delta;&epsilon;&iota;&alpha;&sigmaf; &chi;&rho;ή&sigma;&eta;&sigmaf;, &eta; &omicron;&pi;&omicron;ί&alpha; &pi;&epsilon;&rho;&iota;έ&chi;&epsilon;&iota; &pi;&epsilon;&rho;&iota;&omicron;&rho;&iota;&sigma;&mu;&omicron;ύ&sigmaf; ό&sigma;&omicron;&nu; &alpha;&phi;&omicron;&rho;ά &sigma;&tau;&eta; &chi;&rho;ή&sigma;&eta; &kappa;&alpha;&iota; &tau;&eta;&nu; &kappa;&omicron;&iota;&nu;&omicron;&pi;&omicron;ί&eta;&sigma;ή &tau;&omicron;&upsilon;&sigmaf;, &epsilon;&nu;ώ &pi;&rho;&omicron;&sigma;&tau;&alpha;&tau;&epsilon;ύ&omicron;&nu;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&eta; &nu;&omicron;&mu;&omicron;&theta;&epsilon;&sigma;ί&alpha; &pi;&epsilon;&rho;ί &pi;&nu;&epsilon;&upsilon;&mu;&alpha;&tau;&iota;&kappa;ή&sigmaf; &iota;&delta;&iota;&omicron;&kappa;&tau;&eta;&sigma;ί&alpha;&sigmaf;. &Delta;&epsilon;&nu; &epsilon;&pi;&iota;&tau;&rho;έ&pi;&epsilon;&tau;&alpha;&iota; &eta; &chi;&rho;ή&sigma;&eta;, &alpha;&nu;&tau;&iota;&gamma;&rho;&alpha;&phi;ή, &alpha;&nu;&alpha;&pi;&alpha;&rho;&alpha;&gamma;&omega;&gamma;ή, &mu;&epsilon;&tau;ά&phi;&rho;&alpha;&sigma;&eta;, &mu;&epsilon;&tau;ά&delta;&omicron;&sigma;&eta;, &tau;&rho;&omicron;&pi;&omicron;&pi;&omicron;ί&eta;&sigma;&eta;, &pi;&alpha;&rho;&omicron;&chi;ή ά&delta;&epsilon;&iota;&alpha;&sigmaf; &chi;&rho;ή&sigma;&eta;&sigmaf;, &mu;&epsilon;&tau;&alpha;&beta;ί&beta;&alpha;&sigma;&eta;, &delta;&iota;&alpha;&nu;&omicron;&mu;ή, έ&kappa;&theta;&epsilon;&sigma;&eta;, &epsilon;&kappa;&tau;έ&lambda;&epsilon;&sigma;&eta;, &delta;&eta;&mu;&omicron;&sigma;ί&epsilon;&upsilon;&sigma;&eta; ή &pi;&alpha;&rho;&omicron;&upsilon;&sigma;ί&alpha;&sigma;&eta; &omicron;&pi;&omicron;&iota;&omicron;&upsilon;&delta;ή&pi;&omicron;&tau;&epsilon; &mu;έ&rho;&omicron;&upsilon;&sigmaf;, &mu;&epsilon; &omicron;&pi;&omicron;&iota;&alpha;&delta;ή&pi;&omicron;&tau;&epsilon; &mu;&omicron;&rho;&phi;ή ή &mu;&epsilon; &omicron;&pi;&omicron;&iota;&omicron;&delta;ή&pi;&omicron;&tau;&epsilon; &mu;έ&sigma;&omicron;, &epsilon;&kappa;&tau;ό&sigmaf; &alpha;&pi;ό &tau;&iota;&sigmaf; &pi;&epsilon;&rho;&iota;&pi;&tau;ώ&sigma;&epsilon;&iota;&sigmaf; ό&pi;&omicron;&upsilon; &alpha;&upsilon;&tau;ό &epsilon;&pi;&iota;&tau;&rho;έ&pi;&epsilon;&tau;&alpha;&iota; &rho;&eta;&tau;ά &beta;ά&sigma;&epsilon;&iota; &tau;&eta;&sigmaf; &sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha;&sigmaf; ά&delta;&epsilon;&iota;&alpha;&sigmaf; &chi;&rho;ή&sigma;&eta;&sigmaf; ή &epsilon;&pi;&iota;&tau;&rho;έ&pi;&epsilon;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&eta; &nu;&omicron;&mu;&omicron;&theta;&epsilon;&sigma;ί&alpha;. &Alpha;&pi;&alpha;&gamma;&omicron;&rho;&epsilon;ύ&epsilon;&tau;&alpha;&iota; &eta; &alpha;&pi;&omicron;&sigma;&upsilon;&mu;&pi;ί&lambda;&iota;&sigma;&eta; (reverse engineering) &kappa;&alpha;&iota; &eta; &alpha;&nu;&alpha;&kappa;&alpha;&tau;&alpha;&sigma;&kappa;&epsilon;&upsilon;ή &tau;&omicron;&upsilon; &alpha;&nu;&tau;&iota;&kappa;&epsilon;&iota;&mu;&epsilon;&nu;&iota;&kappa;&omicron;ύ ή &tau;&omicron;&upsilon; &pi;&eta;&gamma;&alpha;ί&omicron;&upsilon; &kappa;ώ&delta;&iota;&kappa;&alpha; (disassembly ή decompilation), &alpha;&pi;&omicron;&sigma;&upsilon;&nu;&alpha;&rho;&mu;&omicron;&lambda;ό&gamma;&eta;&sigma;&eta; ή &alpha;&pi;&omicron;&sigma;ύ&nu;&theta;&epsilon;&sigma;&eta; &tau;&omicron;&upsilon; &pi;&alpha;&rho;ό&nu;&tau;&omicron;&sigmaf; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;&omicron;ύ, &epsilon;&kappa;&tau;ό&sigmaf; &alpha;&pi;ό &tau;&iota;&sigmaf; &pi;&epsilon;&rho;&iota;&pi;&tau;ώ&sigma;&epsilon;&iota;&sigmaf; ό&pi;&omicron;&upsilon; &alpha;&upsilon;&tau;ό &alpha;&pi;&alpha;&iota;&tau;&epsilon;ί&tau;&alpha;&iota; &alpha;&pi;ό &tau;&eta; &nu;&omicron;&mu;&omicron;&theta;&epsilon;&sigma;ί&alpha; &gamma;&iota;&alpha; &delta;&iota;&alpha;&lambda;&epsilon;&iota;&tau;&omicron;&upsilon;&rho;&gamma;&iota;&kappa;ό&tau;&eta;&tau;&alpha;.</p>

<h2>&Alpha;&pi;&omicron;&pi;&omicron;ί&eta;&sigma;&eta; &epsilon;&upsilon;&theta;&upsilon;&nu;ώ&nu; &epsilon;&gamma;&gamma;ύ&eta;&sigma;&eta;&sigmaf;</h2>
<p>&Omicron;&iota; &pi;&lambda;&eta;&rho;&omicron;&phi;&omicron;&rho;ί&epsilon;&sigmaf; &pi;&omicron;&upsilon; &pi;&epsilon;&rho;&iota;έ&chi;&omicron;&nu;&tau;&alpha;&iota; &sigma;&tau;&omicron; &pi;&alpha;&rho;ό&nu; έ&gamma;&gamma;&rho;&alpha;&phi;&omicron; &epsilon;&nu;&delta;έ&chi;&epsilon;&tau;&alpha;&iota; &nu;&alpha; &pi;&epsilon;&rho;&iota;έ&chi;&omicron;&upsilon;&nu; &sigma;&phi;ά&lambda;&mu;&alpha;&tau;&alpha; &kappa;&alpha;&iota; &upsilon;&pi;ό&kappa;&epsilon;&iota;&nu;&tau;&alpha;&iota; &sigma;&epsilon; &alpha;&lambda;&lambda;&alpha;&gamma;έ&sigmaf; &chi;&omega;&rho;ί&sigmaf; &pi;&rho;&omicron;&eta;&gamma;&omicron;ύ&mu;&epsilon;&nu;&eta; &pi;&rho;&omicron;&epsilon;&iota;&delta;&omicron;&pi;&omicron;ί&eta;&sigma;&eta;. &Sigma;&epsilon; &pi;&epsilon;&rho;ί&pi;&tau;&omega;&sigma;&eta; &pi;&omicron;&upsilon; &epsilon;&nu;&tau;&omicron;&pi;ί&sigma;&epsilon;&tau;&epsilon; &sigma;&phi;ά&lambda;&mu;&alpha;&tau;&alpha;, &gamma;&nu;&omega;&sigma;&tau;&omicron;&pi;&omicron;&iota;ή&sigma;&tau;&epsilon; &tau;&alpha; &sigma;&tau;&eta;&nu; &epsilon;&tau;&alpha;&iota;&rho;&epsilon;ί&alpha; &gamma;&rho;&alpha;&pi;&tau;ώ&sigmaf;.</p>

<h2>&Epsilon;&iota;&delta;&omicron;&pi;&omicron;ί&eta;&sigma;&eta; &pi;&epsilon;&rho;&iota;&omicron;&rho;&iota;&sigma;&mu;έ&nu;&omega;&nu; &delta;&iota;&kappa;&alpha;&iota;&omega;&mu;ά&tau;&omega;&nu;</h2>
<p>&Epsilon;ά&nu; &tau;&omicron; &pi;&alpha;&rho;ό&nu; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;ό ή &eta; &sigma;&chi;&epsilon;&tau;&iota;&kappa;ή &mu;&epsilon; &alpha;&upsilon;&tau;ό &tau;&epsilon;&kappa;&mu;&eta;&rho;ί&omega;&sigma;&eta; &pi;&alpha;&rho;&alpha;&delta;ί&delta;&epsilon;&tau;&alpha;&iota; &sigma;&epsilon; &kappa;&upsilon;&beta;&epsilon;&rho;&nu;&eta;&tau;&iota;&kappa;ό ό&rho;&gamma;&alpha;&nu;&omicron; &tau;&omega;&nu; &Eta;.&Pi;.&Alpha;. ή &sigma;&epsilon; ό&pi;&omicron;&iota;&omicron;&nu; &tau;&omicron; &alpha;&delta;&epsilon;&iota;&omicron;&delta;&omicron;&tau;&epsilon;ί &epsilon;&kappa; &mu;έ&rho;&omicron;&upsilon;&sigmaf; &tau;&eta;&sigmaf; &kappa;&upsilon;&beta;έ&rho;&nu;&eta;&sigma;&eta;&sigmaf; &tau;&omega;&nu; &Eta;.&Pi;.&Alpha;., &tau;ό&tau;&epsilon; &epsilon;&phi;&alpha;&rho;&mu;ό&zeta;&epsilon;&tau;&alpha;&iota; &kappa;&alpha;&iota; &eta; &alpha;&kappa;ό&lambda;&omicron;&upsilon;&theta;&eta; &epsilon;&iota;&delta;&omicron;&pi;&omicron;ί&eta;&sigma;&eta;:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>&Epsilon;&iota;&delta;&omicron;&pi;&omicron;ί&eta;&sigma;&eta; &epsilon;&pi;&iota;&kappa;ί&nu;&delta;&upsilon;&nu;&omega;&nu; &epsilon;&phi;&alpha;&rho;&mu;&omicron;&gamma;ώ&nu;</h2>
<p>&Alpha;&upsilon;&tau;ό &tau;&omicron; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;ό ή &tau;&omicron; &upsilon;&lambda;&iota;&sigma;&mu;&iota;&kappa;ό (hardware) έ&chi;&epsilon;&iota; &alpha;&nu;&alpha;&pi;&tau;&upsilon;&chi;&theta;&epsilon;ί &gamma;&iota;&alpha; &gamma;&epsilon;&nu;&iota;&kappa;ή &chi;&rho;ή&sigma;&eta; &sigma;&epsilon; &delta;&iota;ά&phi;&omicron;&rho;&epsilon;&sigmaf; &epsilon;&phi;&alpha;&rho;&mu;&omicron;&gamma;έ&sigmaf; &delta;&iota;&alpha;&chi;&epsilon;ί&rho;&iota;&sigma;&eta;&sigmaf; &pi;&lambda;&eta;&rho;&omicron;&phi;&omicron;&rho;&iota;ώ&nu;. &Delta;&epsilon;&nu; έ&chi;&epsilon;&iota; &alpha;&nu;&alpha;&pi;&tau;&upsilon;&chi;&theta;&epsilon;ί &alpha;&lambda;&lambda;ά &omicron;ύ&tau;&epsilon; &pi;&rho;&omicron;&omicron;&rho;ί&zeta;&epsilon;&tau;&alpha;&iota; &gamma;&iota;&alpha; &chi;&rho;ή&sigma;&eta; &sigma;&epsilon; &epsilon;&phi;&alpha;&rho;&mu;&omicron;&gamma;έ&sigmaf; &pi;&omicron;&upsilon; &alpha;&pi;ό &tau;&eta; &phi;ύ&sigma;&eta; &tau;&omicron;&upsilon;&sigmaf; &epsilon;&gamma;&kappa;&upsilon;&mu;&omicron;&nu;&omicron;ύ&nu; &kappa;&iota;&nu;&delta;ύ&nu;&omicron;&upsilon;&sigmaf;, &sigma;&upsilon;&mu;&pi;&epsilon;&rho;&iota;&lambda;&alpha;&mu;&beta;&alpha;&nu;&omicron;&mu;έ&nu;&omega;&nu; &epsilon;&phi;&alpha;&rho;&mu;&omicron;&gamma;ώ&nu; &pi;&omicron;&upsilon; &epsilon;&nu;&delta;&epsilon;&chi;&omicron;&mu;έ&nu;&omega;&sigmaf; &nu;&alpha; &delta;&eta;&mu;&iota;&omicron;&upsilon;&rho;&gamma;&omicron;ύ&nu; &kappa;ί&nu;&delta;&upsilon;&nu;&omicron; &pi;&rho;ό&kappa;&lambda;&eta;&sigma;&eta;&sigmaf; &tau;&rho;&alpha;&upsilon;&mu;&alpha;&tau;&iota;&sigma;&mu;&omicron;ύ. &Alpha;&nu; &chi;&rho;&eta;&sigma;&iota;&mu;&omicron;&pi;&omicron;&iota;&epsilon;ί&tau;&epsilon; &alpha;&upsilon;&tau;ό &tau;&omicron; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;ό &sigma;&epsilon; &epsilon;&pi;&iota;&kappa;ί&nu;&delta;&upsilon;&nu;&epsilon;&sigmaf; &epsilon;&phi;&alpha;&rho;&mu;&omicron;&gamma;έ&sigmaf;, &tau;ό&tau;&epsilon; &phi;έ&rho;&epsilon;&tau;&epsilon; &tau;&eta;&nu; &epsilon;&upsilon;&theta;ύ&nu;&eta; &gamma;&iota;&alpha; &tau;&eta; &lambda;ή&psi;&eta; ό&lambda;&omega;&nu; &tau;&omega;&nu; &kappa;&alpha;&tau;ά&lambda;&lambda;&eta;&lambda;&omega;&nu; &mu;έ&tau;&rho;&omega;&nu; &gamma;&iota;&alpha; &tau;&eta;&nu; &epsilon;&xi;&alpha;&sigma;&phi;ά&lambda;&iota;&sigma;&eta; &tau;&eta;&sigmaf; &alpha;&delta;&iota;ά&lambda;&epsilon;&iota;&pi;&tau;&eta;&sigmaf; &lambda;&epsilon;&iota;&tau;&omicron;&upsilon;&rho;&gamma;ί&alpha;&sigmaf;, &tau;&eta;&sigmaf; &delta;&eta;&mu;&iota;&omicron;&upsilon;&rho;&gamma;ί&alpha;&sigmaf; &alpha;&nu;&tau;&iota;&gamma;&rho;ά&phi;&omega;&nu; &alpha;&sigma;&phi;&alpha;&lambda;&epsilon;ί&alpha;&sigmaf;, &tau;&eta;&sigmaf; &delta;&eta;&mu;&iota;&omicron;&upsilon;&rho;&gamma;ί&alpha;&sigmaf; &epsilon;&phi;&epsilon;&delta;&rho;&iota;&kappa;ώ&nu; &sigma;&upsilon;&sigma;&tau;&eta;&mu;ά&tau;&omega;&nu; &kappa;&alpha;&iota; &tau;&upsilon;&chi;ό&nu; ά&lambda;&lambda;&omega;&nu; &mu;έ&tau;&rho;&omega;&nu; &pi;&omicron;&upsilon; &alpha;&pi;&alpha;&iota;&tau;&omicron;ύ&nu;&tau;&alpha;&iota; &gamma;&iota;&alpha; &tau;&eta;&nu; &alpha;&sigma;&phi;&alpha;&lambda;ή &chi;&rho;ή&sigma;&eta; &alpha;&upsilon;&tau;&omicron;ύ &tau;&omicron;&upsilon; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;&omicron;ύ. &Eta; Oracle Corporation &kappa;&alpha;&iota; &omicron;&iota; &theta;&upsilon;&gamma;&alpha;&tau;&rho;&iota;&kappa;έ&sigmaf; &tau;&eta;&sigmaf; &alpha;&pi;&omicron;&pi;&omicron;&iota;&omicron;ύ&nu;&tau;&alpha;&iota; &kappa;ά&theta;&epsilon; &epsilon;&upsilon;&theta;ύ&nu;&eta; &gamma;&iota;&alpha; &tau;&upsilon;&chi;ό&nu; &zeta;&eta;&mu;&iota;έ&sigmaf; &pi;&omicron;&upsilon; &pi;&rho;&omicron;&kappa;&alpha;&lambda;&omicron;ύ&nu;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&eta; &chi;&rho;ή&sigma;&eta; &alpha;&upsilon;&tau;&omicron;ύ &tau;&omicron;&upsilon; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;&omicron;ύ &sigma;&epsilon; &epsilon;&pi;&iota;&kappa;ί&nu;&delta;&upsilon;&nu;&epsilon;&sigmaf; &epsilon;&phi;&alpha;&rho;&mu;&omicron;&gamma;έ&sigmaf;.</p>

<h2>&Sigma;&eta;&mu;&epsilon;ί&omega;&sigma;&eta; &gamma;&iota;&alpha; &tau;&alpha; &epsilon;&mu;&pi;&omicron;&rho;&iota;&kappa;ά &sigma;ή&mu;&alpha;&tau;&alpha;</h2>
<p>&Eta; &epsilon;&pi;&omega;&nu;&upsilon;&mu;ί&alpha; Oracle &kappa;&alpha;&iota; Java &epsilon;ί&nu;&alpha;&iota; &sigma;ή&mu;&alpha;&tau;&alpha; &kappa;&alpha;&tau;&alpha;&tau;&epsilon;&theta;έ&nu;&tau;&alpha; &tau;&eta;&sigmaf; &epsilon;&tau;&alpha;&iota;&rho;&epsilon;ί&alpha;&sigmaf; Oracle &kappa;&alpha;&iota;/ή &tau;&omega;&nu; &theta;&upsilon;&gamma;&alpha;&tau;&rho;&iota;&kappa;ώ&nu; &tau;&eta;&sigmaf;. &Omicron;&iota; &upsilon;&pi;ό&lambda;&omicron;&iota;&pi;&epsilon;&sigmaf; &epsilon;&pi;&omega;&nu;&upsilon;&mu;ί&epsilon;&sigmaf; &alpha;&pi;&omicron;&tau;&epsilon;&lambda;&omicron;ύ&nu; &sigma;ή&mu;&alpha;&tau;&alpha; &tau;&omega;&nu; &alpha;&nu;&tau;ί&sigma;&tau;&omicron;&iota;&chi;&omega;&nu; &delta;&iota;&kappa;&alpha;&iota;&omicron;ύ&chi;&omega;&nu; &tau;&omicron;&upsilon;&sigmaf;.</p>
<p>&Omicron;&iota; &epsilon;&pi;&omega;&nu;&upsilon;&mu;ί&epsilon;&sigmaf; Intel &kappa;&alpha;&iota; Intel Xeon &epsilon;ί&nu;&alpha;&iota; &sigma;ή&mu;&alpha;&tau;&alpha; &kappa;&alpha;&tau;&alpha;&tau;&epsilon;&theta;έ&nu;&tau;&alpha; ή &epsilon;&mu;&pi;&omicron;&rho;&iota;&kappa;ά &sigma;ή&mu;&alpha;&tau;&alpha; &tau;&eta;&sigmaf; &epsilon;&tau;&alpha;&iota;&rho;&epsilon;ί&alpha;&sigmaf; Intel Corporation. Ό&lambda;&alpha; &tau;&alpha; &epsilon;&mu;&pi;&omicron;&rho;&iota;&kappa;ά &sigma;ή&mu;&alpha;&tau;&alpha; SPARC &chi;&rho;&eta;&sigma;&iota;&mu;&omicron;&pi;&omicron;&iota;&omicron;ύ&nu;&tau;&alpha;&iota; &mu;&epsilon; &alpha;&delta;&epsilon;&iota;&omicron;&delta;ό&tau;&eta;&sigma;&eta; &kappa;&alpha;&iota; &epsilon;ί&nu;&alpha;&iota; &sigma;ή&mu;&alpha;&tau;&alpha; &kappa;&alpha;&tau;&alpha;&tau;&epsilon;&theta;έ&nu;&tau;&alpha; ή &epsilon;&mu;&pi;&omicron;&rho;&iota;&kappa;ά &sigma;ή&mu;&alpha;&tau;&alpha; &tau;&eta;&sigmaf; &epsilon;&tau;&alpha;&iota;&rho;&epsilon;ί&alpha;&sigmaf; SPARC International, Inc. &Omicron;&iota; &epsilon;&pi;&omega;&nu;&upsilon;&mu;ί&epsilon;&sigmaf; AMD, Opteron, &tau;&omicron; &lambda;&omicron;&gamma;ό&tau;&upsilon;&pi;&omicron; AMD &kappa;&alpha;&theta;ώ&sigmaf; &kappa;&alpha;&iota; &tau;&omicron; &lambda;&omicron;&gamma;ό&tau;&upsilon;&pi;&omicron; AMD Opteron &epsilon;ί&nu;&alpha;&iota; &sigma;ή&mu;&alpha;&tau;&alpha; &kappa;&alpha;&tau;&alpha;&tau;&epsilon;&theta;έ&nu;&tau;&alpha; ή &epsilon;&mu;&pi;&omicron;&rho;&iota;&kappa;ά &sigma;ή&mu;&alpha;&tau;&alpha; &tau;&eta;&sigmaf; &epsilon;&tau;&alpha;&iota;&rho;&epsilon;ί&alpha;&sigmaf; Advanced Micro Devices. &Eta; &epsilon;&pi;&omega;&nu;&upsilon;&mu;ί&alpha; UNIX &epsilon;ί&nu;&alpha;&iota; &sigma;ή&mu;&alpha; &kappa;&alpha;&tau;&alpha;&tau;&epsilon;&theta;έ&nu; &alpha;&delta;&epsilon;&iota;&omicron;&delta;&omicron;&tau;&eta;&mu;έ&nu;&omicron; &mu;έ&sigma;&omega; &tau;&eta;&sigmaf; &epsilon;&tau;&alpha;&iota;&rho;&epsilon;ί&alpha;&sigmaf; The Open Group.</p>

<h2>&Delta;ή&lambda;&omega;&sigma;&eta; &alpha;&pi;&omicron;&pi;&omicron;ί&eta;&sigma;&eta;&sigmaf; &gamma;&iota;&alpha; &pi;&epsilon;&rho;&iota;&epsilon;&chi;ό&mu;&epsilon;&nu;&omicron;, &pi;&rho;&omicron;ϊό&nu;&tau;&alpha; &kappa;&alpha;&iota; &upsilon;&pi;&eta;&rho;&epsilon;&sigma;ί&epsilon;&sigmaf; &pi;&omicron;&upsilon; &pi;&alpha;&rho;έ&chi;&omicron;&nu;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&rho;ί&tau;&omicron;&upsilon;&sigmaf;</h2>
<p>&Tau;&omicron; &pi;&alpha;&rho;ό&nu; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;ό ή &upsilon;&lambda;&iota;&sigma;&mu;&iota;&kappa;ό (hardware) &kappa;&alpha;&theta;ώ&sigmaf; &kappa;&alpha;&iota; &eta; &tau;&epsilon;&kappa;&mu;&eta;&rho;ί&omega;&sigma;&eta; &epsilon;&nu;&delta;έ&chi;&epsilon;&tau;&alpha;&iota; &nu;&alpha; &pi;&alpha;&rho;έ&chi;&omicron;&upsilon;&nu; &pi;&rho;ό&sigma;&beta;&alpha;&sigma;&eta; &sigma;&epsilon; &pi;&epsilon;&rho;&iota;&epsilon;&chi;ό&mu;&epsilon;&nu;&omicron;, &pi;&rho;&omicron;ϊό&nu;&tau;&alpha; &kappa;&alpha;&iota; &upsilon;&pi;&eta;&rho;&epsilon;&sigma;ί&epsilon;&sigmaf; &pi;&omicron;&upsilon; &pi;&alpha;&rho;έ&chi;&omicron;&nu;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&rho;ί&tau;&omicron;&upsilon;&sigmaf; ή &nu;&alpha; &pi;&alpha;&rho;έ&chi;&omicron;&upsilon;&nu; &pi;&lambda;&eta;&rho;&omicron;&phi;&omicron;&rho;ί&epsilon;&sigmaf; &gamma;&iota;&alpha; &alpha;&upsilon;&tau;ά. &Eta; Oracle Corporation &kappa;&alpha;&iota; &omicron;&iota; &theta;&upsilon;&gamma;&alpha;&tau;&rho;&iota;&kappa;έ&sigmaf; &tau;&eta;&sigmaf; &delta;&epsilon;&nu; &phi;έ&rho;&omicron;&upsilon;&nu; &epsilon;&upsilon;&theta;ύ&nu;&eta; &kappa;&alpha;&iota; &alpha;&pi;&omicron;&pi;&omicron;&iota;&omicron;ύ&nu;&tau;&alpha;&iota; &rho;&eta;&tau;ά ό&lambda;&omega;&nu; &tau;&omega;&nu; &epsilon;&gamma;&gamma;&upsilon;ή&sigma;&epsilon;&omega;&nu; &omicron;&pi;&omicron;&iota;&omicron;&upsilon;&delta;ή&pi;&omicron;&tau;&epsilon; &epsilon;ί&delta;&omicron;&upsilon;&sigmaf; &sigma;&epsilon; &sigma;&chi;έ&sigma;&eta; &mu;&epsilon; &pi;&epsilon;&rho;&iota;&epsilon;&chi;ό&mu;&epsilon;&nu;&omicron;, &pi;&rho;&omicron;ϊό&nu;&tau;&alpha; &kappa;&alpha;&iota; &upsilon;&pi;&eta;&rho;&epsilon;&sigma;ί&epsilon;&sigmaf; &pi;&omicron;&upsilon; &pi;&alpha;&rho;έ&chi;&omicron;&nu;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&rho;ί&tau;&omicron;&upsilon;&sigmaf;, &epsilon;&kappa;&tau;ό&sigmaf; &epsilon;ά&nu; ά&lambda;&lambda;&omega;&sigmaf; &pi;&rho;&omicron;&beta;&lambda;έ&pi;&epsilon;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&omicron;&upsilon;&sigmaf; ό&rho;&omicron;&upsilon;&sigmaf; &iota;&sigma;&chi;ύ&omicron;&upsilon;&sigma;&alpha;&sigmaf; &sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha;&sigmaf; &alpha;&nu;ά&mu;&epsilon;&sigma;&alpha; &sigma;&epsilon; &epsilon;&sigma;ά&sigmaf; &kappa;&alpha;&iota; &tau;&eta;&nu; Oracle. &Eta; Oracle Corporation &kappa;&alpha;&iota; &omicron;&iota; &theta;&upsilon;&gamma;&alpha;&tau;&rho;&iota;&kappa;έ&sigmaf; &tau;&eta;&sigmaf; &delta;&epsilon;&nu; &phi;έ&rho;&omicron;&upsilon;&nu; &epsilon;&upsilon;&theta;ύ&nu;&eta; &gamma;&iota;&alpha; &tau;&upsilon;&chi;ό&nu; &alpha;&pi;ώ&lambda;&epsilon;&iota;&epsilon;&sigmaf;, &delta;&alpha;&pi;ά&nu;&epsilon;&sigmaf; ή &zeta;&eta;&mu;ί&epsilon;&sigmaf; &pi;&omicron;&upsilon; &omicron;&phi;&epsilon;ί&lambda;&omicron;&nu;&tau;&alpha;&iota; &sigma;&tau;&eta;&nu; &pi;&rho;ό&sigma;&beta;&alpha;&sigma;&eta; ή &sigma;&tau;&eta; &chi;&rho;ή&sigma;&eta; &pi;&epsilon;&rho;&iota;&epsilon;&chi;&omicron;&mu;έ&nu;&omicron;&upsilon;, &pi;&rho;&omicron;ϊό&nu;&tau;&omega;&nu; ή &upsilon;&pi;&eta;&rho;&epsilon;&sigma;&iota;ώ&nu; &pi;&omicron;&upsilon; &pi;&alpha;&rho;έ&chi;&omicron;&nu;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&rho;ί&tau;&omicron;&upsilon;&sigmaf;, &epsilon;&kappa;&tau;ό&sigmaf; &epsilon;ά&nu; &alpha;&upsilon;&tau;ό &pi;&rho;&omicron;&beta;&lambda;έ&pi;&epsilon;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&omicron;&upsilon;&sigmaf; ό&rho;&omicron;&upsilon;&sigmaf; &iota;&sigma;&chi;ύ&omicron;&upsilon;&sigma;&alpha;&sigmaf; &sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha;&sigmaf; &alpha;&nu;ά&mu;&epsilon;&sigma;&alpha; &sigma;&epsilon; &epsilon;&sigma;ά&sigmaf; &kappa;&alpha;&iota; &tau;&eta;&nu; Oracle.</p>

<h2>&Pi;&rho;ώ&tau;&omicron; &kappa;&alpha;&iota; &delta;&epsilon;ύ&tau;&epsilon;&rho;&omicron; &pi;&rho;&omicron;&sigma;&chi;έ&delta;&iota;&omicron; &delta;ή&lambda;&omega;&sigma;&eta;&sigmaf; &tau;&epsilon;&kappa;&mu;&eta;&rho;ί&omega;&sigma;&eta;&sigmaf;</h2>
<p>&Epsilon;ά&nu; &tau;&omicron; &pi;&alpha;&rho;ό&nu; έ&gamma;&gamma;&rho;&alpha;&phi;&omicron; &beta;&rho;ί&sigma;&kappa;&epsilon;&tau;&alpha;&iota; &sigma;&epsilon; &kappa;&alpha;&tau;ά&sigma;&tau;&alpha;&sigma;&eta; &pi;&rho;&omicron;-&pi;&alpha;&rho;&alpha;&gamma;&omega;&gamma;ή&sigmaf;:</p>
<p>&Alpha;&upsilon;&tau;ή &eta; &tau;&epsilon;&kappa;&mu;&eta;&rho;ί&omega;&sigma;&eta; &beta;&rho;ί&sigma;&kappa;&epsilon;&tau;&alpha;&iota; &sigma;&epsilon; &kappa;&alpha;&tau;ά&sigma;&tau;&alpha;&sigma;&eta; &pi;&rho;&omicron;έ&kappa;&delta;&omicron;&sigma;&eta;&sigmaf; &kappa;&alpha;&iota; &pi;&rho;&omicron;&omicron;&rho;ί&zeta;&epsilon;&tau;&alpha;&iota; &gamma;&iota;&alpha; &pi;&alpha;&rho;&omicron;&upsilon;&sigma;&iota;ά&sigma;&epsilon;&iota;&sigmaf; &kappa;&alpha;&iota; &pi;&rho;&omicron;&kappa;&alpha;&tau;&alpha;&rho;&kappa;&tau;&iota;&kappa;ή &chi;&rho;ή&sigma;&eta; &mu;ό&nu;&omicron;. &Mu;&pi;&omicron;&rho;&epsilon;ί &nu;&alpha; &mu;&eta;&nu; &epsilon;ί&nu;&alpha;&iota; &epsilon;&xi;&epsilon;&iota;&delta;&iota;&kappa;&epsilon;&upsilon;&mu;έ&nu;&omicron; &gamma;&iota;&alpha; &tau;&omicron; &upsilon;&lambda;&iota;&sigma;&mu;&iota;&kappa;ό (hardware) &mu;&epsilon; &tau;&omicron; &omicron;&pi;&omicron;ί&omicron; &chi;&rho;&eta;&sigma;&iota;&mu;&omicron;&pi;&omicron;&iota;&epsilon;ί&tau;&epsilon; &tau;&omicron; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;ό. &Eta; Oracle Corporation &kappa;&alpha;&iota; &omicron;&iota; &theta;&upsilon;&gamma;&alpha;&tau;&rho;&iota;&kappa;έ&sigmaf; &tau;&eta;&sigmaf; &alpha;&pi;&omicron;&pi;&omicron;&iota;&omicron;ύ&nu;&tau;&alpha;&iota; &kappa;ά&theta;&epsilon; &epsilon;&upsilon;&theta;ύ&nu;&eta; &kappa;&alpha;&iota; &delta;&epsilon;&nu; &pi;&alpha;&rho;έ&chi;&omicron;&upsilon;&nu; &omicron;&upsilon;&delta;&epsilon;&mu;ί&alpha; &epsilon;&gamma;&gamma;ύ&eta;&sigma;&eta; &omicron;&pi;&omicron;&iota;&omicron;&upsilon;&delta;ή&pi;&omicron;&tau;&epsilon; &epsilon;ί&delta;&omicron;&upsilon;&sigmaf; &sigma;&chi;&epsilon;&tau;&iota;&kappa;ά &mu;&epsilon; &tau;&eta;&nu; &pi;&alpha;&rho;&omicron;ύ&sigma;&alpha; &tau;&epsilon;&kappa;&mu;&eta;&rho;ί&omega;&sigma;&eta; &kappa;&alpha;&iota; &delta;&epsilon;&nu; &theta;&alpha; &phi;έ&rho;&omicron;&upsilon;&nu; &epsilon;&upsilon;&theta;ύ&nu;&eta; &gamma;&iota;&alpha; &omicron;&pi;&omicron;&iota;&alpha;&delta;ή&pi;&omicron;&tau;&epsilon; &alpha;&pi;ώ&lambda;&epsilon;&iota;&alpha;, έ&xi;&omicron;&delta;&alpha; ή &zeta;&eta;&mu;ί&epsilon;&sigmaf;  &pi;&omicron;&upsilon; &pi;&rho;&omicron;&kappa;&alpha;&lambda;&omicron;ύ&nu;&tau;&alpha;&iota; &alpha;&pi;ό &tau;&eta; &chi;&rho;ή&sigma;&eta; &alpha;&upsilon;&tau;ή&sigmaf; &tau;&eta;&sigmaf; &tau;&epsilon;&kappa;&mu;&eta;&rho;ί&omega;&sigma;&eta;&sigmaf;.</p>

<h2>&Epsilon;&iota;&delta;&omicron;&pi;&omicron;ί&eta;&sigma;&eta; &iota;&delta;&iota;&omega;&tau;&iota;&kappa;ώ&nu; &pi;&rho;&omicron;&sigma;&chi;έ&delta;&iota;&omega;&nu; &epsilon;&gamma;&gamma;&rho;ά&phi;&omega;&nu; Alpha &kappa;&alpha;&iota; Beta</h2>
<p>&Epsilon;ά&nu; &tau;&omicron; &pi;&alpha;&rho;ό&nu; έ&gamma;&gamma;&rho;&alpha;&phi;&omicron; &beta;&rho;ί&sigma;&kappa;&epsilon;&tau;&alpha;&iota; &sigma;&epsilon; &kappa;&alpha;&tau;ά&sigma;&tau;&alpha;&sigma;&eta; &alpha;&pi;ό&rho;&rho;&eta;&tau;&eta;&sigmaf; &pi;&rho;&omicron;έ&kappa;&delta;&omicron;&sigma;&eta;&sigmaf;:</p>
<p>&Omicron;&iota; &pi;&lambda;&eta;&rho;&omicron;&phi;&omicron;&rho;ί&epsilon;&sigmaf; &pi;&omicron;&upsilon; &pi;&epsilon;&rho;&iota;έ&chi;&omicron;&nu;&tau;&alpha;&iota; &sigma;&tau;&omicron; &pi;&alpha;&rho;ό&nu; έ&gamma;&gamma;&rho;&alpha;&phi;&omicron; &pi;&rho;&omicron;&omicron;&rho;ί&zeta;&omicron;&nu;&tau;&alpha;&iota; &gamma;&iota;&alpha; &epsilon;&pi;&iota;&kappa;&omicron;&iota;&nu;&omega;&nu;&iota;&alpha;&kappa;&omicron;ύ&sigmaf; &sigma;&kappa;&omicron;&pi;&omicron;ύ&sigmaf; &kappa;&alpha;&iota; &pi;&rho;έ&pi;&epsilon;&iota; &nu;&alpha; &epsilon;&kappa;&lambda;&alpha;&mu;&beta;ά&nu;&omicron;&nu;&tau;&alpha;&iota; &mu;&epsilon; &tau;&eta;&nu; &theta;έ&sigma;&eta; &pi;&omicron;&upsilon; έ&chi;&epsilon;&tau;&epsilon; &omega;&sigmaf; &mu;έ&lambda;&omicron;&sigmaf; &sigma;&upsilon;&mu;&beta;&omicron;&upsilon;&lambda;&epsilon;&upsilon;&tau;&iota;&kappa;ή&sigmaf; &epsilon;&pi;&iota;&tau;&rho;&omicron;&pi;ή&sigmaf; ή &sigma;ύ&mu;&phi;&omega;&nu;&alpha; &mu;&epsilon; &tau;&eta; &sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha; &pi;&omicron;&upsilon; έ&chi;&epsilon;&tau;&epsilon; &gamma;&iota;&alpha; &alpha;&upsilon;&tau;ή &tau;&eta; &delta;&omicron;&kappa;&iota;&mu;&alpha;&sigma;&tau;&iota;&kappa;ή (beta) έ&kappa;&delta;&omicron;&sigma;&eta; &mu;ό&nu;&omicron;. &Delta;&epsilon;&nu; &alpha;&pi;&omicron;&tau;&epsilon;&lambda;&epsilon;ί &delta;έ&sigma;&mu;&epsilon;&upsilon;&sigma;&eta; &gamma;&iota;&alpha; &tau;&eta;&nu; &pi;&alpha;&rho;ά&delta;&omicron;&sigma;&eta; &omicron;&pi;&omicron;&iota;&omicron;&upsilon;&delta;ή&pi;&omicron;&tau;&epsilon; &upsilon;&lambda;&iota;&kappa;&omicron;ύ, &kappa;ώ&delta;&iota;&kappa;&alpha; ή &lambda;&epsilon;&iota;&tau;&omicron;&upsilon;&rho;&gamma;&iota;&kappa;ό&tau;&eta;&tau;&alpha;&sigmaf; &kappa;&alpha;&iota; &delta;&epsilon;&nu; &theta;&alpha; &pi;&rho;έ&pi;&epsilon;&iota; &nu;&alpha; &epsilon;&pi;&alpha;&phi;ί&epsilon;&sigma;&tau;&epsilon; &sigma;&epsilon; &alpha;&upsilon;&tau;ό &gamma;&iota;&alpha; &tau;&eta;&nu; &lambda;ή&psi;&eta; &tau;&omega;&nu; &alpha;&pi;&omicron;&phi;ά&sigma;&epsilon;ώ&nu; &sigma;&alpha;&sigmaf; &gamma;&iota;&alpha; &alpha;&gamma;&omicron;&rho;έ&sigmaf;. &Eta; &alpha;&nu;ά&pi;&tau;&upsilon;&xi;&eta;, έ&kappa;&delta;&omicron;&sigma;&eta; &kappa;&alpha;&iota; &chi;&rho;&omicron;&nu;&iota;&sigma;&mu;ό&sigmaf; &alpha;&upsilon;&tau;ώ&nu; &tau;&omega;&nu; &chi;&alpha;&rho;&alpha;&kappa;&tau;&eta;&rho;&iota;&sigma;&tau;&iota;&kappa;ώ&nu; ή &lambda;&epsilon;&iota;&tau;&omicron;&upsilon;&rho;&gamma;&iota;&kappa;ό&tau;&eta;&tau;&alpha;&sigmaf; ό&pi;&omega;&sigmaf; &pi;&epsilon;&rho;&iota;&gamma;&rho;ά&phi;&epsilon;&tau;&alpha;&iota; &sigma;&tau;&omicron; &pi;&alpha;&rho;ό&nu; έ&gamma;&gamma;&rho;&alpha;&phi;&omicron; &epsilon;&pi;&alpha;&phi;ί&epsilon;&tau;&alpha;&iota; &alpha;&pi;&omicron;&kappa;&lambda;&epsilon;&iota;&sigma;&tau;&iota;&kappa;ά &sigma;&tau;&eta;&nu; &epsilon;&upsilon;&chi;έ&rho;&epsilon;&iota;&alpha; &tau;&eta;&sigmaf; Oracle.</p>
<p>&Tau;&omicron; &pi;&alpha;&rho;ό&nu; έ&gamma;&gamma;&rho;&alpha;&phi;&omicron; &sigma;&epsilon; &omicron;&pi;&omicron;&iota;&alpha;&delta;ή&pi;&omicron;&tau;&epsilon; &mu;&omicron;&rho;&phi;ή, &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;ό ή &epsilon;&kappa;&tau;&upsilon;&pi;&omega;&mu;έ&nu;&omicron; &mu;έ&sigma;&omicron;, &pi;&epsilon;&rho;&iota;έ&chi;&epsilon;&iota; &iota;&delta;&iota;ό&kappa;&tau;&eta;&tau;&epsilon;&sigmaf; &pi;&lambda;&eta;&rho;&omicron;&phi;&omicron;&rho;ί&epsilon;&sigmaf; &pi;&omicron;&upsilon; &alpha;&pi;&omicron;&tau;&epsilon;&lambda;&omicron;ύ&nu; &alpha;&pi;&omicron;&kappa;&lambda;&epsilon;&iota;&sigma;&tau;&iota;&kappa;ή &iota;&delta;&iota;&omicron;&kappa;&tau;&eta;&sigma;ί&alpha; &tau;&eta;&sigmaf; Oracle. &Eta; &pi;&rho;ό&sigma;&beta;&alpha;&sigma;ή &sigma;&alpha;&sigmaf; &sigma;&epsilon; &kappa;&alpha;&iota; &eta; &chi;&rho;ή&sigma;&eta; &tau;&omicron;&upsilon; &epsilon;&mu;&pi;&iota;&sigma;&tau;&epsilon;&upsilon;&tau;&iota;&kappa;&omicron;ύ &upsilon;&lambda;&iota;&kappa;&omicron;ύ &upsilon;&pi;ό&kappa;&epsilon;&iota;&nu;&tau;&alpha;&iota; &sigma;&epsilon; ό&rho;&omicron;&upsilon;&sigmaf; &kappa;&alpha;&iota; &sigma;&upsilon;&nu;&theta;ή&kappa;&epsilon;&sigmaf; &pi;&omicron;&upsilon; &pi;&epsilon;&rho;&iota;&lambda;&alpha;&mu;&beta;ά&nu;&omicron;&nu;&tau;&alpha;&iota; &sigma;&tau;&eta;&nu; &Kappa;ύ&rho;&iota;&alpha; &Sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha; &tau;&eta;&sigmaf; Oracle, &sigma;&tau;&eta; &Sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha; Ά&delta;&epsilon;&iota;&alpha;&sigmaf; &Chi;&rho;ή&sigma;&eta;&sigmaf; &kappa;&alpha;&iota; &Pi;&alpha;&rho;&omicron;&chi;ή&sigmaf; &Upsilon;&pi;&eta;&rho;&epsilon;&sigma;&iota;ώ&nu; &tau;&eta;&sigmaf; Oracle, &sigma;&tau;&eta; &Sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha; &Delta;&iota;&kappa;&tau;ύ&omicron;&upsilon; &Sigma;&upsilon;&nu;&epsilon;&rho;&gamma;&alpha;&tau;ώ&nu; &tau;&eta;&sigmaf; Oracle, &sigma;&tau;&eta; &sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha; &delta;&iota;&alpha;&nu;&omicron;&mu;ή&sigmaf; &tau;&eta;&sigmaf; Oracle ή &sigma;&epsilon; ά&lambda;&lambda;&eta; &sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha; ά&delta;&epsilon;&iota;&alpha;&sigmaf; &chi;&rho;ή&sigma;&eta;&sigmaf; &pi;&omicron;&upsilon; έ&chi;&epsilon;&iota; &epsilon;&kappa;&tau;&epsilon;&lambda;&epsilon;&sigma;&tau;&epsilon;ί &alpha;&pi;ό &epsilon;&sigma;ά&sigmaf; &kappa;&alpha;&iota; &tau;&eta;&nu; Oracle &kappa;&alpha;&iota; &mu;&epsilon; &tau;&eta;&nu; &omicron;&pi;&omicron;ί&alpha; &sigma;&upsilon;&mu;&phi;&omega;&nu;&epsilon;ί&tau;&alpha;&iota; &nu;&alpha; &sigma;&upsilon;&mu;&mu;&omicron;&rho;&phi;ώ&nu;&epsilon;&sigma;&tau;&epsilon;. &Tau;&omicron; &pi;&alpha;&rho;ό&nu; έ&gamma;&gamma;&rho;&alpha;&phi;&omicron; &kappa;&alpha;&iota; &omicron;&iota; &pi;&epsilon;&rho;&iota;&epsilon;&chi;ό&mu;&epsilon;&nu;&epsilon;&sigmaf; &sigma;&epsilon; &alpha;&upsilon;&tau;ό &pi;&lambda;&eta;&rho;&omicron;&phi;&omicron;&rho;ί&epsilon;&sigmaf; &delta;&epsilon;&nu; &pi;&rho;έ&pi;&epsilon;&iota; &nu;&alpha; &alpha;&pi;&omicron;&kappa;&alpha;&lambda;&upsilon;&phi;&theta;&omicron;ύ&nu;, &alpha;&nu;&tau;&iota;&gamma;&rho;&alpha;&phi;&omicron;ύ&nu;, &alpha;&nu;&alpha;&pi;&alpha;&rho;&alpha;&chi;&theta;&omicron;ύ&nu;, ή &delta;&iota;&alpha;&nu;&epsilon;&mu;&eta;&theta;&omicron;ύ&nu; &sigma;&epsilon; &omicron;&pi;&omicron;&iota;&omicron;&nu;&delta;ή&pi;&omicron;&tau;&epsilon; &epsilon;&kappa;&tau;ό&sigmaf; &tau;&eta;&sigmaf; Oracle &chi;&omega;&rho;ί&sigmaf; &tau;&eta;&nu; &pi;&rho;&omega;&tau;ύ&tau;&epsilon;&rho;&eta; &sigma;&upsilon;&nu;&alpha;ί&nu;&epsilon;&sigma;&eta; &tau;&eta;&sigmaf; Oracle. &Tau;&omicron; &pi;&alpha;&rho;ό&nu; έ&gamma;&gamma;&rho;&alpha;&phi;&omicron; &delta;&epsilon;&nu; &alpha;&pi;&omicron;&tau;&epsilon;&lambda;&epsilon;ί &tau;&mu;ή&mu;&alpha; &tau;&eta;&sigmaf; &sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha;&sigmaf; &lambda;&omicron;&gamma;&iota;&sigma;&mu;&iota;&kappa;&omicron;ύ &sigma;&alpha;&sigmaf; &kappa;&alpha;&iota; &delta;&epsilon;&nu; &mu;&pi;&omicron;&rho;&epsilon;ί &nu;&alpha; &epsilon;&nu;&sigma;&omega;&mu;&alpha;&tau;&omega;&theta;&epsilon;ί &sigma;&epsilon; &omicron;&pi;&omicron;&iota;&alpha;&delta;ή&pi;&omicron;&tau;&epsilon; &sigma;&upsilon;&mu;&phi;&omega;&nu;ί&alpha; &sigma;&upsilon;&mu;&beta;&omicron;&lambda;&alpha;ί&omicron;&upsilon; &mu;&epsilon; &tau;&eta;&nu; Oracle ή &tau;&iota;&sigmaf; &theta;&upsilon;&gamma;&alpha;&tau;&rho;&iota;&kappa;έ&sigmaf; ή &sigma;&upsilon;&nu;&epsilon;&rho;&gamma;ά&tau;&epsilon;&sigmaf; &alpha;&upsilon;&tau;ή&sigmaf;.</p>

<h2>&Pi;&rho;&omicron;&sigma;&beta;&alpha;&sigma;&iota;&mu;ό&tau;&eta;&tau;&alpha; &sigma;&tau;&eta;&nu; &tau;&epsilon;&kappa;&mu;&eta;&rho;ί&omega;&sigma;&eta;</h2>
<p>&Gamma;&iota;&alpha; &pi;&lambda;&eta;&rho;&omicron;&phi;&omicron;&rho;ί&epsilon;&sigmaf; &sigma;&chi;&epsilon;&tau;&iota;&kappa;ά &mu;&epsilon; &tau;&eta; &delta;έ&sigma;&mu;&epsilon;&upsilon;&sigma;&eta; &tau;&eta;&sigmaf; Oracle &sigma;&tau;&eta;&nu; &pi;&rho;&omicron;&sigma;&beta;&alpha;&sigma;&iota;&mu;ό&tau;&eta;&tau;&alpha;, &epsilon;&pi;&iota;&sigma;&kappa;&epsilon;&phi;&theta;&epsilon;ί&tau;&epsilon; &tau;&omicron;&nu; &iota;&sigma;&tau;ό&tau;&omicron;&pi;&omicron; &tau;&omicron;&upsilon; &pi;&rho;&omicron;&gamma;&rho;ά&mu;&mu;&alpha;&tau;&omicron;&sigmaf; &pi;&rho;&omicron;&sigma;&beta;&alpha;&sigma;&iota;&mu;ό&tau;&eta;&tau;&alpha;&sigmaf; &sigma;&tau;&eta; &delta;&iota;&epsilon;ύ&theta;&upsilon;&nu;&sigma;&eta; <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>&Pi;&rho;ό&sigma;&beta;&alpha;&sigma;&eta; &sigma;&tau;&eta;&nu; &Upsilon;&pi;&omicron;&sigma;&tau;ή&rho;&iota;&xi;&eta; &tau;&eta;&sigmaf; Oracle</p>
<p>&Omicron;&iota; &pi;&epsilon;&lambda;ά&tau;&epsilon;&sigmaf; &tau;&eta;&sigmaf; Oracle, &omicron;&iota; &omicron;&pi;&omicron;ί&omicron;&iota; έ&chi;&omicron;&upsilon;&nu; &alpha;&gamma;&omicron;&rho;ά&sigma;&epsilon;&iota; &upsilon;&pi;&eta;&rho;&epsilon;&sigma;ί&epsilon;&sigmaf; &tau;&epsilon;&chi;&nu;&iota;&kappa;ή&sigmaf; &upsilon;&pi;&omicron;&sigma;&tau;ή&rho;&iota;&xi;&eta;&sigmaf;, έ&chi;&omicron;&upsilon;&nu; &pi;&rho;ό&sigma;&beta;&alpha;&sigma;&eta; &sigma;&epsilon; &eta;&lambda;&epsilon;&kappa;&tau;&rho;&omicron;&nu;&iota;&kappa;ή &upsilon;&pi;&omicron;&sigma;&tau;ή&rho;&iota;&xi;&eta; &mu;έ&sigma;&omega; &tau;&eta;&sigmaf; &upsilon;&pi;&eta;&rho;&epsilon;&sigma;ί&alpha;&sigmaf; &upsilon;&pi;&omicron;&sigma;&tau;ή&rho;&iota;&xi;&eta;&sigmaf; &tau;&eta;&sigmaf; Oracle. &Gamma;&iota;&alpha; &pi;&lambda;&eta;&rho;&omicron;&phi;&omicron;&rho;ί&epsilon;&sigmaf;, &epsilon;&pi;&iota;&sigma;&kappa;&epsilon;&phi;&theta;&epsilon;ί&tau;&epsilon; &tau;&eta; &delta;&iota;&epsilon;ύ&theta;&upsilon;&nu;&sigma;&eta; <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code> ή &epsilon;&pi;&iota;&sigma;&kappa;&epsilon;&phi;&theta;&epsilon;ί&tau;&epsilon; &tau;&eta; &delta;&iota;&epsilon;ύ&theta;&upsilon;&nu;&sigma;&eta; <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code> &epsilon;ά&nu; έ&chi;&epsilon;&tau;&epsilon; &pi;&rho;&omicron;&beta;&lambda;ή&mu;&alpha;&tau;&alpha; &alpha;&kappa;&omicron;ή&sigmaf;.</p>


<p><img alt="&Lambda;&omicron;&gamma;ό&tau;&upsilon;&pi;&omicron; &tau;&eta;&sigmaf; Oracle" src="../gifs/oracle.gif"/></p>


</body></html>