<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="tr" lang="tr"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114868"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Oracle%20Yasal%20Bildirimleri"></a><title>Oracle Yasal Bildirimleri</title>
</head>
<body>
<h1>Oracle Yasal Bildirimleri</h1>

<h2>Telif Hakkı Bildirimi</h2>
<p>Telif hakkı &copy; 1994-2016, Oracle ve/veya Oracle&#39;a bağlı kuruluşlar. T&uuml;m hakları saklıdır.</p>

<h2>Lisans Şartları Garanti/Dolaylı Hasarlar ile İlgili Sorumluluk Reddi</h2>
<p>Bu yazılım ve ilgili dok&uuml;manlar, kullanımı ve başkalarına a&ccedil;ıklanmasına ilişkin sınırlamalar i&ccedil;eren bir lisans s&ouml;zleşmesi &ccedil;er&ccedil;evesinde sağlanmakta ve fikri m&uuml;lkiyet yasaları tarafından korunmaktadır. Lisans s&ouml;zleşmenizde a&ccedil;ık&ccedil;a izin verilmediği veya yasalarca hak tanınmadığı takdirde, yazılımları veya yazılımların bir b&ouml;l&uuml;m&uuml;n&uuml; herhangi bir şekilde veya herhangi bir yolla kullanma, kopyalama, &ccedil;oğaltma, terc&uuml;me, radyo ya da televizyonla yayınlama, değiştirme, lisanslama, g&ouml;nderme, dağıtma, teşhir etme, ifa etme, yayımlama veya herhangi bir b&ouml;l&uuml;m&uuml;n&uuml; g&ouml;r&uuml;nt&uuml;leme hakkına sahip değilsiniz. Yazılımlar &uuml;zerinde ters m&uuml;hendislik işlemi yapılması, programların derlemesinin &ccedil;&ouml;z&uuml;lmesi veya kaynak koda d&ouml;n&uuml;şt&uuml;r&uuml;lmesi, yasalar tarafından başka yazılımlarla birlikte &ccedil;alışılabilirliği sağlamak i&ccedil;in gerekli olması dışında yasaktır.</p>

<h2>Garanti ile İlgili Sorumluluk Reddi</h2>
<p>Bu dok&uuml;manda yer alan bilgiler &ouml;nceden bildirilmeksizin değiştirilebilir ve bunların hatasız olduğu garantisi verilmemektedir. Dok&uuml;manda hatalarla karşılaşırsanız, l&uuml;tfen bize yazılı olarak bildirin.</p>

<h2>Sınırlı Haklar Bildirimi</h2>
<p>Bu yazılım veya ilgili dok&uuml;manlar, Amerika Birleşik Devletleri H&uuml;k&uuml;metine veya Amerika Birleşik Devletleri H&uuml;k&uuml;meti adına lisanslayan veya kullanan herhangi bir kişiye teslim ediliyorsa, aşağıdaki uyarı ge&ccedil;erli olacaktır:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Tehlikeli Uygulamalar Bildirimi</h2>
<p>Bu yazılım veya donanım bir&ccedil;ok bilgi y&ouml;netimi uygulamalarının genel kullanımı i&ccedil;in geliştirilmiştir. Kişisel yaralanmalara yol a&ccedil;abilecek riskleri olan uygulamalar dahil, niteliği gereği tehlikeli olan uygulamaların kullanımına y&ouml;nelik olarak geliştirilmemiştir. Bu yazılımı veya donanımı tehlikeli uygulamalarla kullanırsanız, bu t&uuml;rden uygulamaların g&uuml;venliğini sağlamak &uuml;zere hataya karşı g&uuml;venlik, yedek kopya, yedekleme ve diğer gerekli t&uuml;m &ouml;nlemleri alma sorumluluğu size aittir. Oracle Corporation ve/veya bağlı kuruluşları  bu yazılımın veya donanımın tehlikeli uygulamalarda kullanımı sonucu ortaya &ccedil;ıkabilecek her t&uuml;rl&uuml; zarara ilişkin sorumluluğu reddetmektedir.</p>

<h2>Ticari Marka Bildirimi</h2>
<p>Oracle ve Java, Oracle Corporation ve/veya Oracle&#39;a bağlı kuruluşlara ait tescilli markalardır. Diğer adlar ise ilgili sahiplerinin markaları olabilir.</p>
<p>Intel ve Intel Xeon, Intel Corporation&#39;un markaları veya tescilli markalarıdır. T&uuml;m SPARC markaları, SPARC International Inc.&#39;&#39;n markaları veya tescilli markalardır ve lisans kapsamında kullanılır. AMD, Opteron, AMD logosu, ve AMD Opteron logosu, Advanced Micro Devices&#39;ın markaları veya tescilli markalarıdır. UNIX, Open Group&#39;un tescilli markasıdır.</p>

<h2>&Uuml;&ccedil;&uuml;nc&uuml; Taraf Kuruluşlara Ait İ&ccedil;erik, &Uuml;r&uuml;nler ve Servisler ile İlgili Sorumluluk Reddi</h2>
<p>Bu yazılım veya donanım ve dok&uuml;mantasyon &uuml;&ccedil;&uuml;nc&uuml; taraf kuruluşlara ait i&ccedil;eriğe veya bilgiye, &uuml;r&uuml;nlere ve servislere erişim sağlayabilir. Siz ve Oracle arasında, aksinin belirtildiği, uygulanabilir bir anlaşma yapılmadığı takdirde; Oracle Corporation ve bağlı kuruluşları &uuml;&ccedil;&uuml;nc&uuml; taraf kuruluşlara ait i&ccedil;erik, &uuml;r&uuml;nler ve servislerden sorumlu değildir ve bunlara ilişkin her t&uuml;rl&uuml; garantiyi a&ccedil;ık bir şekilde reddetmektedir. Siz ve Oracle arasında, aksinin belirtildiği, uygulanabilir bir anlaşma yapılmadığı takdirde; Oracle Corporation ve bağlı kuruluşları, &uuml;&ccedil;&uuml;nc&uuml; taraf kuruluşlara ait i&ccedil;erik, &uuml;r&uuml;nler veya servislere erişim ya da kullanımdan dolayı maruz kalabileceğiniz hi&ccedil;bir kayıp, masraf veya zarardan sorumlu değildir.</p>

<h2>Alfa ve Beta Taslağı Dok&uuml;mantasyon Bildirimi</h2>
<p>Bu dok&uuml;man &ouml;n &uuml;retim stat&uuml;s&uuml;nde ise:</p>
<p>Bu dok&uuml;mantasyon &ouml;n &uuml;retim stat&uuml;s&uuml;ndedir ve sadece g&ouml;sterim ve hazırlık i&ccedil;in kullanılması ama&ccedil;lanmıştır. Bu dok&uuml;mantasyon, yazılımı &ccedil;alıştırdığınız donanıma &ouml;zel olmayabilir. Oracle Corporation ve bağlı kuruluşları bu dok&uuml;mantasyon ile ilgili herhangi bir garantiden sorumlu değildir ve her t&uuml;rl&uuml; garantiyi a&ccedil;ık bir şekilde reddetmektedir ve bu dok&uuml;mantasyonun kullanımından dolayı maruz kalabileceğiniz hi&ccedil;bir kayıp, masraf veya zarardan sorumlu değildir.</p>

<h2>&Ouml;zel Alfa ve Beta Taslak Dok&uuml;mantasyon Bildirimi</h2>
<p>Bu dok&uuml;man &ouml;zel &ouml;n &uuml;retim stat&uuml;s&uuml;nde ise:</p>
<p>Bu belgedeki bilgiler yalnızca bilgi verme amacıyla paylaşılmaktadır ve yalnızca m&uuml;şteri danışma kurulu &uuml;yesi olarak yetkiniz dahilinde veya beta deneme anlaşmanızın h&uuml;k&uuml;mleri dahilinde değerlendirilmelidir. Bu bilgiler, herhangi bir materyal, kod veya fonksiyonalitenin sağlanmasına/teslimine y&ouml;nelik bir taahh&uuml;t değildir ve satın alma kararı verilirken dikkate alınmamalıdır. Bu belgede belirtilen herhangi bir &ouml;zelliğin veya fonksiyonalitenin geliştirilmesi, yayınlanması/(piyasaya) sunulması ve zamanlanması, yalnızca Oracle&#39;ın takdir ve insiyatifindedir.</p>
<p>Yazılım veya basılı malzeme şeklinde, herhangi bir şekilde olmak &uuml;zere bu dok&uuml;man, m&uuml;lkiyeti m&uuml;nhasıran Oracle&#39;a ait, m&uuml;lkiyeti kapsamında bilgiler i&ccedil;ermektedir. Bu gizli bilgilere erişiminiz ve bunları kullanımınız, siz ve Oracle tarafından akdedilen ve uyulması kabul edilen Oracle Ana Anlaşması, Oracle Lisans ve Hizmet Anlaşması, Oracle İş Ortakları Ağı Anlaşması, Oracle dağıtım anlaşması, veya diğer lisans anlaşmasının h&uuml;k&uuml;m ve koşullarına tabidir. Bu dok&uuml;man ve i&ccedil;erdiği bilgiler, &ouml;nceden Oracle&#39;dan yazılı izin alınmadan, Oracle dışındaki taraflara a&ccedil;ıklanamaz, kopyalanamaz, &ccedil;oğaltılamaz veya dağıtılamaz. Bu dok&uuml;man, lisans anlaşmanızın bir par&ccedil;ası değildir; Oracle, iştirakleri veya doğrudan/dolaylı bağlı kuruluşları ile yapılmış herhangi bir anlaşmaya dahil edilemez.</p>

<h2>Dok&uuml;mantasyon Erişilebilirliği</h2>
<p>Oracle&#39;ın erişilebilirlik ile ilgili taahh&uuml;tleri hakkında bilgileri <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code> adresindeki Oracle Erişilebilirlik Programı web sitesinden edinebilirsiniz.</p>
<p>Oracle Desteğine Erişim</p>
<p>Oracle destek satın alan m&uuml;şteriler, My Oracle Support &uuml;zerinden elektronik desteğe erişebilirler. Daha fazla bilgiyi <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code> veya işitme engelliyseniz <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code> adresindeki web sitemizden edinebilirsiniz.</p>


<p><img alt="Oracle Logosu" src="../gifs/oracle.gif"/></p>


</body></html>