<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fi" lang="fi"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114831"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Oraclen%20oikeudelliset%20huomautukset"></a><title>Oraclen oikeudelliset huomautukset</title>
</head>
<body>
<h1>Oraclen oikeudelliset huomautukset</h1>

<h2>Tekij&auml;noikeudet</h2>
<p>Copyright &copy; 1994-2016, Oracle ja/tai sen tyt&auml;r-, sisar- tai osakkuusyhti&ouml;t. Kaikki oikeudet pid&auml;tet&auml;&auml;n.</p>

<h2>K&auml;ytt&ouml;oikeusrajoitukset ja takuuta sek&auml; v&auml;lillisten vahinkojen korvaamista koskeva vastuuvapaus</h2>
<p>Ohjelmisto ja siihen liittyv&auml; dokumentaatio annetaan k&auml;ytt&ouml;&ouml;n k&auml;ytt&ouml;- ja salassapitorajoituksia sis&auml;lt&auml;v&auml;&auml;n k&auml;ytt&ouml;oikeussopimukseen perustuen. Ohjelmisto ja dokumentaatio on suojattu tekij&auml;noikeuksia, patentteja ja muita teollisoikeuksia koskevilla laeilla. Ellei k&auml;ytt&ouml;oikeussopimuksessa nimenomaan toisin todeta tai laki sit&auml; salli, mit&auml;&auml;n osaa ei saa k&auml;ytt&auml;&auml;, kopioida, j&auml;ljent&auml;&auml;, k&auml;&auml;nt&auml;&auml;, l&auml;hett&auml;&auml;, muokata, lisensoida, levitt&auml;&auml;, jaella, suorittaa, julkaista, esitt&auml;&auml; tai n&auml;ytt&auml;&auml; miss&auml;&auml;n muodossa tai mill&auml;&auml;n keinoin. Ohjelmiston koodin muodon k&auml;&auml;nt&auml;minen, palauttaminen symboliselle konekielelle ja purkaminen on kielletty paitsi silloin, kun laki sit&auml; edellytt&auml;&auml; yhteentoimivuuden varmistamiseksi.</p>

<h2>Takuuta koskeva vastuuvapaus</h2>
<p>T&auml;ss&auml; esitetyt tiedot voivat muuttua ilman eri ilmoitusta, eik&auml; Oracle takaa tietojen virheett&ouml;myytt&auml;. Jos tiedoista l&ouml;ytyy virheellisyyksi&auml;, pyyd&auml;mme ilmoittamaan niist&auml; meille kirjallisesti.</p>

<h2>Rajoitettuja oikeuksia koskeva lauseke</h2>
<p>Jos t&auml;m&auml; on ohjelmisto tai siihen liittyv&auml; dokumentaatio, joka toimitetaan USA:n valtiolle, valtionhallinnolle tai jollekin osapuolelle, joka my&ouml;nt&auml;&auml; k&auml;ytt&ouml;oikeuksia USA:n valtionhallinnon puolesta, seuraavia m&auml;&auml;r&auml;yksi&auml; sovelletaan:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Vaaralliset k&auml;ytt&ouml;kohteet</h2>
<p>T&auml;m&auml; ohjelmisto tai laitteisto on tarkoitettu yleisk&auml;ytt&ouml;&ouml;n erilaisissa tiedonhallinnan sovelluksissa. Ohjelmistoa ei ole suunniteltu eik&auml; tarkoitettu k&auml;ytett&auml;v&auml;ksi miss&auml;&auml;n yleisvaarallisessa sovelluksessa, mukaan lukien sovellukset, joiden yhteydess&auml; voi muodostua vamman tai loukkaantumisen riski. Jos t&auml;t&auml; ohjelmistoa tai laitteistoa k&auml;ytet&auml;&auml;n vaarallisissa sovelluksissa, k&auml;ytt&auml;j&auml;n vastuulla on ryhty&auml; kaikkiin tarvittaviin varotoimiin, mukaan lukien varaj&auml;rjestelmien yll&auml;pito ja varmuuskopiointi, turvallisen k&auml;yt&ouml;n varmistamiseksi. Oracle Corporation ja sen tyt&auml;r-, sisar- tai osakkuusyhti&ouml;t eiv&auml;t ole vastuussa mist&auml;&auml;n vahingoista, jotka aiheutuvat ohjelmiston tai laitteiston k&auml;yt&ouml;st&auml; vaarallisissa sovelluksissa.</p>

<h2>Tavaramerkit</h2>
<p>Oracle ja Java ovat Oraclen ja/tai sen tyt&auml;r-, sisar- tai osakkuusyhti&ouml;iden rekister&ouml;ityj&auml; tavaramerkkej&auml;. Muut nimet saattavat olla omistajiensa tavaramerkkej&auml;.</p>
<p>Intel ja Intel Xeon ovat Intel Corporationin tavaramerkkej&auml; tai rekister&ouml;ityj&auml; tavaramerkkej&auml;. Kaikkia SPARC-tavaramerkkej&auml; k&auml;ytet&auml;&auml;n lisenssin nojalla, ja ne ovat SPARC International, Inc:n tavaramerkkej&auml; tai rekister&ouml;ityj&auml; tavaramerkkej&auml;. AMD, Opteron, AMD-logo ja AMD Opteron -logo Advanced Micro Devicesin tavaramerkkej&auml; tai rekister&ouml;ityj&auml; tavaramerkkej&auml;. UNIX on The Open Groupin rekister&ouml;ity tavaramerkki.</p>

<h2>Kolmannen osapuolen sis&auml;lt&ouml;&auml;, tuotteita ja palveluita koskeva vastuuvapaus</h2>
<p>T&auml;m&auml; ohjelmisto tai laitteisto ja dokumentaatio saattavat mahdollistaa p&auml;&auml;syn kolmansien osapuolten tuotteisiin, sis&auml;lt&ouml;&ouml;n tai palveluihin, tai saattavat sis&auml;lt&auml;&auml; niist&auml; tietoa. Oracle Corporation ja sen tyt&auml;r-, sisar- tai osakkuusyhti&ouml;t eiv&auml;t vastaa mill&auml;&auml;n tavoin mist&auml;&auml;n takuusta, joka liittyy kolmansien osapuolten tuotteisiin, sis&auml;lt&ouml;ihin tai palveluihin, ellei k&auml;ytt&auml;j&auml;n ja Oraclen v&auml;lisess&auml; sovellettavassa sopimuksessa ole esitetty muuta. Oracle Corporation ja sen tyt&auml;r-, sisar- tai osakkuusyhti&ouml;t eiv&auml;t vastaa mist&auml;&auml;n asiakkaalle aiheutuneesta menetyksest&auml;, kustannuksesta tai vahingosta, joka syntyy asiakkaan k&auml;ytetty&auml; kolmansien osapuolten tuotteita, sis&auml;lt&ouml;&auml; tai palveluita, ellei k&auml;ytt&auml;j&auml;n ja Oraclen v&auml;lisess&auml; sovellettavassa sopimuksessa ole esitetty muuta.</p>

<h2>Dokumentaatioluonnosten alfa- ja beta-versiot</h2>
<p>Jos t&auml;m&auml; dokumentaatio on luonteeltaan kehitysversio:</p>
<p>T&auml;m&auml; dokumentaatio on luonteeltaan kehitysversio ja se on tarkoitettu ainoastaan esittelytarkoituksiin ja alustavaan ennakkok&auml;ytt&ouml;&ouml;n. Se ei v&auml;ltt&auml;m&auml;tt&auml; sovellu laitteistoon, jossa k&auml;yt&auml;t ohjelmistoa. Oracle Corporation ja sen tyt&auml;r-, sisar- tai osakkuusyhti&ouml;t eiv&auml;t vastaa mill&auml;&auml;n tavoin mist&auml;&auml;n t&auml;h&auml;n dokumentaatioon liittyv&auml;st&auml; takuusta tai t&auml;m&auml;n dokumentaation k&auml;yt&ouml;st&auml; aiheutuvista menetyksist&auml;, kustannuksista ja vahingoista.</p>

<h2>Dokumentaatioluonnosten yksityiset alfa- ja beta-versiot</h2>
<p>Jos t&auml;m&auml; dokumentaatio on luonteeltaan yksityinen kehitysversio:</p>
<p>T&auml;m&auml;n asiakirjan tiedot on tarkoitettu vain tiedoksi, ja sit&auml; on k&auml;ytett&auml;v&auml; ainoastaan asiakkaiden neuvottelukunnan j&auml;senen&auml; tai betakokeilusopimuksen mukaisesti. Se ei ole sitoumus mink&auml;&auml;n aineiston, koodin tai toiminnon toimittamisesta, eik&auml; sit&auml; saa k&auml;ytt&auml;&auml; hankintap&auml;&auml;t&ouml;sten perustana. T&auml;ss&auml; asiakirjassa kuvattujen ominaisuuksien tai toimintojen kehitys, julkaisu ja ajoitus on yksinomaan Oraclen p&auml;&auml;tett&auml;viss&auml;.</p>
<p>T&auml;m&auml; asiakirja sis&auml;lt&auml;&auml; kaikissa muodoissa, ohjelmistona tai painettuna asiakirjana, Oraclen yksinomaisesti omistamia tietoja. T&auml;m&auml;n luottamuksellisen materiaalin k&auml;yt&ouml;ss&auml; sovelletaan k&auml;ytt&auml;j&auml;n ja Oraclen v&auml;lisen ja k&auml;ytt&auml;j&auml;n hyv&auml;ksym&auml;n Oracle Master Agreement -sopimuksen, Oraclen lisenssi- ja palvelusopimuksen, Oracle PartnerNetwork Agreement -sopimuksen, Oraclen jakelusopimuksen tai muun k&auml;ytt&ouml;oikeussopimuksen ehtoja. T&auml;t&auml; asiakirjaa ja siin&auml; olevia tietoja ei saa luovuttaa, kopioida, j&auml;ljent&auml;&auml; tai levitt&auml;&auml; kenellek&auml;&auml;n Oraclen ulkopuolella ilman Oraclen etuk&auml;teen antamaa kirjallista lupaa. T&auml;m&auml; asiakirja ei ole osa k&auml;ytt&ouml;oikeussopimusta, eik&auml; sit&auml; voi sis&auml;llytt&auml;&auml; mihink&auml;&auml;n sopimukseen Oraclen tai sen tyt&auml;r-, sisar- tai osakkuusyhti&ouml;iden kanssa.</p>

<h2>Dokumentaation k&auml;ytett&auml;vyys</h2>
<p>Lis&auml;tietoja Oraclen sitoutumisesta k&auml;ytett&auml;vyyteen on Oracle Accessibility Program -Web-sivustossa osoitteessa <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>Oraclen tuen k&auml;ytt&ouml;oikeus</p>
<p>Tukipalvelun tilanneet Oraclen asiakkaat voivat k&auml;ytt&auml;&auml; elektronista tukea My Oracle Support -tukipalvelun kautta. Lis&auml;tietoja on osoitteessa <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code>. Kuulovammaisille on lis&auml;tietoja osoitteessa <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code>.</p>


<p><img alt="Oraclen logo" src="../gifs/oracle.gif"/></p>


</body></html>