<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="es" lang="es"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114828"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Disposiciones%20legales%20de%20Oracle"></a><title>Disposiciones legales de Oracle</title>
</head>
<body>
<h1>Disposiciones legales de Oracle</h1>

<h2>Disposici&oacute;n de Copyright</h2>
<p>Copyright &copy; 1994-2016, Oracle y/o sus filiales. Todos los derechos reservados.</p>

<h2>Garant&iacute;a de restricciones de licencia/Exenci&oacute;n de responsabilidad de da&ntilde;os consecuenciales</h2>
<p>Este software y la documentaci&oacute;n relacionada est&aacute;n sujetos a un contrato de licencia que incluye restricciones de uso y revelaci&oacute;n, y se encuentran protegidos por la legislaci&oacute;n sobre la propiedad intelectual. A menos que figure expl&iacute;citamente en el contrato de licencia o est&eacute; permitido por la ley, no se podr&aacute; utilizar, copiar, reproducir, traducir, emitir, modificar, conceder licencias, transmitir, distribuir, exhibir, representar, publicar ni mostrar ninguna parte, de ninguna forma, por ning&uacute;n medio. Queda prohibida la ingenier&iacute;a inversa, desensamblaje o descompilaci&oacute;n de este software, excepto en la medida en que sean necesarios para conseguir interoperabilidad seg&uacute;n lo especificado por la legislaci&oacute;n aplicable.</p>

<h2>Exenci&oacute;n de responsabilidad de la garant&iacute;a</h2>
<p>La informaci&oacute;n contenida en este documento puede someterse a modificaciones sin previo aviso y no se garantiza que se encuentre exenta de errores. Si detecta alg&uacute;n error, le agradeceremos que nos lo comunique por escrito.</p>

<h2>Disposici&oacute;n de derechos restringidos</h2>
<p>Si este software o la documentaci&oacute;n relacionada se entrega al Gobierno de EE.UU. o a cualquier entidad que adquiera las licencias en nombre del Gobierno de EE.UU. entonces aplicar&aacute; la siguiente disposici&oacute;n:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Disposici&oacute;n de aplicaciones peligrosas</h2>
<p>Este software o hardware se ha desarrollado para uso general en diversas aplicaciones de gesti&oacute;n de la informaci&oacute;n. No se ha dise&ntilde;ado ni est&aacute; destinado para utilizarse en aplicaciones de riesgo inherente, incluidas las aplicaciones que pueden causar da&ntilde;os personales. Si utiliza este software o hardware en aplicaciones de riesgo, usted ser&aacute; responsable de tomar todas las medidas apropiadas de prevenci&oacute;n de fallos, copia de seguridad, redundancia o de cualquier otro tipo para garantizar la seguridad en el uso de este software o hardware. Oracle Corporation y sus filiales declinan toda responsabilidad derivada de los da&ntilde;os causados por el uso de este software o hardware en aplicaciones de riesgo.</p>

<h2>Disposici&oacute;n de marca registrada</h2>
<p>Oracle y Java son marcas registradas de Oracle y/o sus filiales. Todos los dem&aacute;s nombres pueden ser marcas comerciales de sus respectivos propietarios.</p>
<p>Intel e Intel Xeon son marcas comerciales o marcas comerciales registradas de Intel Corporation. Todas las marcas comerciales de SPARC se utilizan con licencia y son marcas comerciales o marcas comerciales registradas de SPARC International, Inc. AMD, Opteron, el logotipo de AMD y el logotipo de AMD Opteron son marcas comerciales o marcas comerciales registradas de Advanced Micro Devices. UNIX es una marca comercial registrada de The Open Group.</p>

<h2>Exenci&oacute;n de responsabilidad sobre el contenido, los productos y los servicios de terceros</h2>
<p>Este software o hardware y la documentaci&oacute;n pueden proporcionar acceso a, o informaci&oacute;n sobre contenidos, productos o servicios de terceros. Oracle Corporation o sus filiales no son responsables y por ende desconocen cualquier tipo de garant&iacute;a sobre el contenido, los productos o los servicios de terceros a menos que se indique otra cosa en un acuerdo en vigor formalizado entre Ud. y Oracle. Oracle Corporation y sus filiales no ser&aacute;n responsables frente a cualesquiera p&eacute;rdidas, costos o da&ntilde;os en los que se incurra como consecuencia de su acceso o su uso de contenidos, productos o servicios de terceros a menos que se indique otra cosa en un acuerdo en vigor formalizado entre Ud. y Oracle.</p>

<h2>Disposici&oacute;n de la documentaci&oacute;n en borradores Alfa y Beta</h2>
<p>Si este documento se encuentra en estado previo a la publicaci&oacute;n:</p>
<p>Esta documentaci&oacute;n se encuentra en estado previo a producci&oacute;n y tiene una finalidad exclusivamente demostrativa y preliminar. Puede que no sea espec&iacute;fica del hardware en el que se est&eacute; utilizando el software. Ni Oracle Corporation ni sus filiales son responsables de ofrecer cualquier tipo de garant&iacute;a sobre esta documentaci&oacute;n y renuncian expl&iacute;citamente a ello; adem&aacute;s no se har&aacute;n responsables de las p&eacute;rdidas, los costos o los da&ntilde;os en los que se incurra como consecuencia del uso de esta documentaci&oacute;n.</p>

<h2>Disposici&oacute;n privada de la documentaci&oacute;n en borradores Alfa y Beta</h2>
<p>Si este documento se encuentra en estado privado previo a la publicaci&oacute;n:</p>
<p>La informaci&oacute;n incluida en este documento se proporciona a efectos &uacute;nicamente informativos y deber&iacute;a tenerla en cuenta tan solo en calidad de miembro del comit&eacute; asesor del cliente o conforme al acuerdo firmado sobre prueba de versiones beta. No supone compromiso alguno de entrega de ning&uacute;n material, c&oacute;digo o funcionalidad, ni debe constituir base alguna para la adopci&oacute;n de decisiones de compra. El desarrollo, lanzamiento y plazo de puesta a disposici&oacute;n de cualesquiera funciones o funcionalidades descritas en este documento quedar&aacute; a la sola discreci&oacute;n de Oracle.</p>
<p>Este documento, en cualquier formato, software o impreso, contiene informaci&oacute;n protegida que es propiedad exclusiva de Oracle. Su acceso y uso de este material confidencial est&aacute; sujeto a los t&eacute;rminos y condiciones de su Acuerdo Marco Oracle, Acuerdo de Licencia y Servicios Oracle, Acuerdo Oracle PartnerNetwork, Acuerdo de Distribuci&oacute;n Oracle u otro acuerdo de licencia formalizado entre Ud. y Oracle y que usted se obliga a cumplir. Este documento y la informaci&oacute;n que contiene no podr&aacute;n ser revelados, copiados, reproducidos ni distribuidos a ninguna persona ajena a Oracle sin el consentimiento previo por escrito de Oracle. Este documento no forma parte de su acuerdo de licencia ni se puede incorporar a ning&uacute;n acuerdo contractual con Oracle ni sus subsidiarias o filiales.</p>

<h2>Accesibilidad a la documentaci&oacute;n</h2>
<p>Para obtener informaci&oacute;n acerca del compromiso de Oracle con la accesibilidad, visite el sitio web del Programa de Accesibilidad de Oracle en <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>Acceso a Oracle Support</p>
<p>Los clientes de Oracle que hayan adquirido servicios de soporte disponen de acceso a soporte electr&oacute;nico a trav&eacute;s de My Oracle Support. Para obtener informaci&oacute;n, visite <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code> o <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code> si tiene problemas de audici&oacute;n.</p>


<p><img alt="Logotipo de Oracle" src="../gifs/oracle.gif"/></p>


</body></html>