<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="hu" lang="hu"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114838"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Oracle%20jogi%20k%C3%B6zlem%C3%A9nyek"></a><title>Oracle jogi k&ouml;zlem&eacute;nyek</title>
<link rel="stylesheet" href="../css/blafdoc.css" type="text/css"/>
</head>
<body>
<h1>Oracle jogi k&ouml;zlem&eacute;nyek</h1>

<h2>Szerzői jogi nyilatkozat</h2>
<p>Copyright &copy; 1994-2016, Az Oracle &eacute;s/vagy le&aacute;nyv&aacute;llalatai. Minden jog fenntartva.</p>

<h2>Korl&aacute;tozott licencre illetve garanci&aacute;lis/k&ouml;vetkezm&eacute;nyes k&aacute;rokra vonatkoz&oacute; nyilatkozat</h2>
<p>A Szoftver &eacute;s a kapcsol&oacute;d&oacute; dokument&aacute;ci&oacute; &aacute;tad&aacute;sa a haszn&aacute;latra &eacute;s titoktart&aacute;sra vonatkoz&oacute;an korl&aacute;toz&oacute; szab&aacute;lyokat tartalmaz&oacute; licencszerződ&eacute;s keret&eacute;ben t&ouml;rt&eacute;nik, &eacute;s szellemi jogi v&eacute;delem al&aacute; esik. Tilos a szoftvert &eacute;s a dokument&aacute;ci&oacute;t r&eacute;szben vagy eg&eacute;szben, b&aacute;rmilyen form&aacute;ban vagy m&oacute;don lem&aacute;solni, reproduk&aacute;lni, ford&iacute;tani, k&ouml;zz&eacute;tenni, m&oacute;dos&iacute;tani, licencbe adni, tov&aacute;bb&iacute;tani, forgalmazni, ki&aacute;ll&iacute;tani, előadni vagy nyilv&aacute;noss&aacute;gra hozni, kiv&eacute;ve ha ehhez a licencszerződ&eacute;s vagy a jogszab&aacute;lyi elő&iacute;r&aacute;sok kifejezett form&aacute;ban enged&eacute;lyt biztos&iacute;tanak. Tilos a jelen szoftver visszaford&iacute;t&aacute;sa, visszafejt&eacute;se, szerkezet&eacute;nek felt&aacute;r&aacute;sa, kiv&eacute;ve, ha az jogszab&aacute;lyi elő&iacute;r&aacute;s alapj&aacute;n, m&aacute;s szoftverterm&eacute;kekkel val&oacute; egy&uuml;ttműk&ouml;d&eacute;s biztos&iacute;t&aacute;s&aacute;hoz sz&uuml;ks&eacute;ges.</p>

<h2>Garanci&aacute;lis nyilatkozat</h2>
<p>A dokument&aacute;ci&oacute;ban szereplő adatok előzetes &eacute;rtes&iacute;t&eacute;s n&eacute;lk&uuml;l m&oacute;dosulhatnak, &eacute;s a dokument&aacute;ci&oacute; hibamentess&eacute;ge nem garant&aacute;lt. Amennyiben b&aacute;rmilyen hib&aacute;t &eacute;szlel, k&eacute;rj&uuml;k, sz&iacute;veskedj&eacute;k azt r&eacute;sz&uuml;nkre &iacute;r&aacute;sban jelezni.</p>

<h2>Korl&aacute;tozott jogokr&oacute;l sz&oacute;l&oacute; megjegyz&eacute;s</h2>
<p>Amennyiben a szoftver vagy a kapcsol&oacute;d&oacute; dokument&aacute;ci&oacute; az Egyes&uuml;lt &Aacute;llamok korm&aacute;nya r&eacute;sz&eacute;re, vagy a szoftvert az Egyes&uuml;lt &Aacute;llamok korm&aacute;nya nev&eacute;ben licencelő vagy haszn&aacute;l&oacute; f&eacute;l sz&aacute;m&aacute;ra ker&uuml;l sz&aacute;ll&iacute;t&aacute;sra, az al&aacute;bbi nyilatkozat alkalmazand&oacute;:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Vesz&eacute;lyes haszn&aacute;latra vonatkoz&oacute; megjegyz&eacute;s</h2>
<p>Jelen szoftver vagy hardver k&uuml;l&ouml;nf&eacute;le inform&aacute;ci&oacute;kezel&eacute;si alkalmaz&aacute;sokban t&ouml;rt&eacute;nő, &aacute;ltal&aacute;nos c&eacute;l&uacute; felhaszn&aacute;l&aacute;sra k&eacute;sz&uuml;lt. Nem eredendően vesz&eacute;lyes alkalmaz&aacute;sokban, p&eacute;ld&aacute;ul szem&eacute;lyi s&eacute;r&uuml;l&eacute;s kock&aacute;zat&aacute;val j&aacute;r&oacute; alkalmaz&aacute;sokban val&oacute; felhaszn&aacute;l&aacute;sra k&eacute;sz&uuml;lt. Amennyiben &Ouml;n ezt a szoftvert vagy hardvert vesz&eacute;lyes alkalmaz&aacute;sokban haszn&aacute;lja, &Ouml;n felelős az adott alkalmaz&aacute;sok biztons&aacute;gos haszn&aacute;lat&aacute;hoz sz&uuml;ks&eacute;ges biztons&aacute;gi m&aacute;solatok elk&eacute;sz&iacute;t&eacute;s&eacute;&eacute;rt, illetve a megfelelő hibamentes&iacute;t&eacute;si- &eacute;s egy&eacute;b int&eacute;zked&eacute;sek megt&eacute;tel&eacute;&eacute;rt. Az Oracle Corporation &eacute;s le&aacute;nyv&aacute;llalatai kiz&aacute;rj&aacute;k felelőss&eacute;g&uuml;ket a jelen szoftver vagy hardver vesz&eacute;lyes alkalmaz&aacute;sokban t&ouml;rt&eacute;nő haszn&aacute;lat&aacute;b&oacute;l eredő k&aacute;rok&eacute;rt.</p>

<h2>V&eacute;djegyekre vonatkoz&oacute; megjegyz&eacute;s</h2>
<p>Az Oracle &eacute;s a Java az Oracle, illetve le&aacute;nyv&aacute;llalatai bejegyzett v&eacute;djegye. A t&ouml;bbi n&eacute;v is v&eacute;djegyoltalom alatt &aacute;ll&oacute; lehet.</p>
<p>Az Intel &eacute;s az Intel Xeon az Intel Corporation v&eacute;djegye vagy bejegyzett v&eacute;djegye. Minden SPARC v&eacute;djegy csak licenccel haszn&aacute;lhat&oacute;, &eacute;s a SPARC International, Inc v&eacute;djegye vagy bejegyzett v&eacute;djegye. Az AMD, az Opteron, az AMD embl&eacute;ma &eacute;s az AMD Opteron embl&eacute;ma az Advanced Micro Devices v&eacute;djegye vagy bejegyzett v&eacute;djegye. A UNIX az Open Group bejegyzett v&eacute;djegye.</p>

<h2>Harmadik f&eacute;l &aacute;ltal k&eacute;sz&iacute;tett tartalomra, term&eacute;kekre &eacute;s szolg&aacute;ltat&aacute;sokra vonatkoz&oacute; nyilatkozat</h2>
<p>A jelen szoftverben vagy hardverben &eacute;s dokument&aacute;ci&oacute;ban szerepelhetnek harmadik f&eacute;l &aacute;ltal ny&uacute;jtott tartalomra, term&eacute;kekre &eacute;s szolg&aacute;ltat&aacute;sokra vonatkoz&oacute; inform&aacute;ci&oacute;k, illetve ezekhez val&oacute; hozz&aacute;f&eacute;r&eacute;st biztos&iacute;t&oacute; hivatkoz&aacute;sok. Az Oracle Corporation &eacute;s le&aacute;nyv&aacute;llalatai kiz&aacute;rnak mindennemű felelőss&eacute;get &eacute;s j&oacute;t&aacute;ll&aacute;si k&ouml;telezetts&eacute;get a harmadik f&eacute;l &aacute;ltal ny&uacute;jtott tartalomra, term&eacute;kekre &eacute;s szolg&aacute;ltat&aacute;sokra vonatkoz&oacute;an, kiv&eacute;ve, ha az &Ouml;n&ouml;k &eacute;s az Oracle erre vonatkoz&oacute; szerződ&eacute;se ezeket m&aacute;sk&eacute;nt hat&aacute;rozza meg. Az Oracle Corporation &eacute;s le&aacute;nyv&aacute;llalatai kiz&aacute;rj&aacute;k felelőss&eacute;g&uuml;ket a harmadik f&eacute;l &aacute;ltal ny&uacute;jtott tartalom, term&eacute;kek, illetve szolg&aacute;ltat&aacute;sok haszn&aacute;lat&aacute;b&oacute;l vagy ezekhez val&oacute; hozz&aacute;f&eacute;r&eacute;sből eredő vesztes&eacute;g&eacute;rt, k&ouml;lts&eacute;gek&eacute;rt &eacute;s k&aacute;rok&eacute;rt, kiv&eacute;ve, ha az &Ouml;n&ouml;k &eacute;s az Oracle erre vonatkoz&oacute; szerződ&eacute;se ezeket m&aacute;sk&eacute;nt hat&aacute;rozza meg.</p>

<h2>Alfa &eacute;s Beta dokument&aacute;ci&oacute;tervezettel kapcsolatos megjegyz&eacute;s</h2>
<p>Ha a dokumentum előzetes &aacute;llapot&uacute;:</p>
<p>A jelen dokument&aacute;ci&oacute;t előzetes jellegűnek kell tekinteni, &eacute;s csak demonstr&aacute;ci&oacute;s c&eacute;lb&oacute;l, illetve előzetes haszn&aacute;latra alkalmazand&oacute;. Előfordulhat, hogy a dokument&aacute;ci&oacute; nem specifikus az &Ouml;n szoftvert futtat&oacute; hardverk&ouml;rnyezet&eacute;re. Az Oracle Corporation &eacute;s le&aacute;nyv&aacute;llalatai a dokument&aacute;ci&oacute;&eacute;rt semmif&eacute;le szavatoss&aacute;got nem v&aacute;llalnak, tov&aacute;bb&aacute; a dokument&aacute;ci&oacute; haszn&aacute;lat&aacute;b&oacute;l eredő vesztes&eacute;g&eacute;rt, k&ouml;lts&eacute;gek&eacute;rt &eacute;s k&aacute;rok&eacute;rt val&oacute; valamennyi felelőss&eacute;g&uuml;ket a t&ouml;rv&eacute;ny &aacute;ltal megengedett legteljesebb m&eacute;rt&eacute;kben kiz&aacute;rj&aacute;k.</p>

<h2>A belső haszn&aacute;lat&uacute; Alfa &eacute;s Beta dokument&aacute;ci&oacute;tervezettel kapcsolatos megjegyz&eacute;s</h2>
<p>Ha a dokumentum belső haszn&aacute;lat&uacute; előzetes &aacute;llapot&uacute;:</p>
<p>Az ebben a dokumentumban l&eacute;vő inform&aacute;ci&oacute; csak t&aacute;j&eacute;koztat&aacute;s c&eacute;l&uacute;, csak &Ouml;nnek, mint az &uuml;gyf&eacute;l-t&aacute;j&eacute;koztat&aacute;sban r&eacute;sztvevő test&uuml;let tagj&aacute;nak sz&oacute;l, vagy csak a b&eacute;tatesztel&eacute;si szerződ&eacute;se miatt kapta meg. Nem jelent k&ouml;telezetts&eacute;get valamilyen anyag, k&oacute;d vagy k&eacute;pess&eacute;g ny&uacute;jt&aacute;s&aacute;ra, &eacute;s nem sz&aacute;m&iacute;t v&aacute;s&aacute;rl&aacute;si d&ouml;nt&eacute;st megalapoz&oacute; anyagnak sem. A jelen dokumentumban ismertetett tov&aacute;bbfejleszt&eacute;s, k&ouml;zread&aacute;s, illetve b&aacute;rmilyen funkci&oacute; időz&iacute;t&eacute;se tov&aacute;bbra is az Oracle saj&aacute;t d&ouml;nt&eacute;s&eacute;n m&uacute;lik.</p>
<p>Ez a dokumentum minden megjelen&eacute;s form&aacute;j&aacute;ban, szoftverk&eacute;nt vagy nyomtatott anyagk&eacute;nt olyan v&eacute;dett inform&aacute;ci&oacute;kat tartalmaz, amelynek kiz&aacute;r&oacute;lag az Oracle a jogtulajdonosa. Ezen bizalmas anyagnak a hozz&aacute;f&eacute;r&eacute;s&eacute;t &eacute;s felhaszn&aacute;l&aacute;s&aacute;t az Oracle Master Agreement, az Oracle License and Services Agreement, az Oracle PartnerNetwork Agreement, az Oracle disztrib&uacute;tori szerződ&eacute;s vagy egy&eacute;b olyan licencszerződ&eacute;s felt&eacute;telei &eacute;s kik&ouml;t&eacute;sei hat&aacute;rozz&aacute;k meg, amely &Ouml;n&ouml;k &eacute;s az Oracle k&ouml;z&ouml;tt megk&ouml;tetett, &eacute;s amelyek betart&aacute;s&aacute;t &Ouml;n&ouml;k elfogadt&aacute;k. Ez a dokumentum &eacute;s a benne megjelenő inform&aacute;ci&oacute; nem tehető nyilv&aacute;noss&aacute;, nem m&aacute;solhat&oacute;, nem reproduk&aacute;lhat&oacute; &eacute;s nem terjeszthető az Oracle előzetes &iacute;r&aacute;sbeli beleegyez&eacute;se n&eacute;lk&uuml;l senkinek az Oracle szervezet&eacute;n k&iacute;v&uuml;l. Ez a dokumentum nem r&eacute;sze az &Ouml;n licencszerződ&eacute;s&eacute;nek, &eacute;s nem is foglalhat&oacute; be az Oracle, illetve valamelyik r&eacute;szlege vagy le&aacute;nyv&aacute;llalata szerződ&eacute;ses meg&aacute;llapod&aacute;s&aacute;ba.</p>

<h2>A dokumentum akad&aacute;lymentess&eacute;ge</h2>
<p>Az Oracle akad&aacute;lymentess&eacute;gi elk&ouml;telezetts&eacute;g&eacute;ről az Oracle akad&aacute;lymentess&eacute;gi webhely&eacute;n kaphat t&aacute;j&eacute;koztat&aacute;st: <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>Az Oracle Support el&eacute;rhetős&eacute;ge</p>
<p>Az Oracle azon &uuml;gyfelei, akik term&eacute;kt&aacute;mogat&aacute;si szolg&aacute;ltat&aacute;st v&aacute;s&aacute;roltak, az elektronikus term&eacute;kt&aacute;mogat&aacute;st a My Oracle Support webhelyre bejelentkezve vehetik ig&eacute;nybe. A t&aacute;j&eacute;koztat&aacute;s&eacute;rt a <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code> vagy ha hall&aacute;ss&eacute;r&uuml;ltek a <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code> webhelyet keress&eacute;k fel.</p>


<p><img alt="Oracle embl&eacute;ma" src="../gifs/oracle.gif"/></p>


</body></html>