<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="pt-BR" lang="pt-BR"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114856"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Avisos%20Legais%20da%20Oracle"></a><title>Avisos Legais da Oracle</title>
</head>
<body>
<h1>Avisos Legais da Oracle</h1>

<h2>Aviso de Copyright</h2>
<p>Copyright &copy; 1994-2016, Oracle e/ou suas empresas afiliadas. Todos os direitos reservados.</p>

<h2>Restri&ccedil;&otilde;es de Licen&ccedil;a e Isen&ccedil;&atilde;o de Garantia/Danos Consequenciais</h2>
<p>Este programa de computador e sua documenta&ccedil;&atilde;o s&atilde;o fornecidos sob um contrato de licen&ccedil;a que cont&eacute;m restri&ccedil;&otilde;es sobre seu uso e divulga&ccedil;&atilde;o, sendo tamb&eacute;m protegidos pela legisla&ccedil;&atilde;o de propriedade intelectual. Exceto em situa&ccedil;&otilde;es expressamente permitidas no contrato de licen&ccedil;a ou por lei, n&atilde;o &eacute; permitido usar, reproduzir, traduzir, divulgar, modificar, licenciar, transmitir, distribuir, expor, executar, publicar ou exibir qualquer parte deste programa de computador e de sua documenta&ccedil;&atilde;o, de qualquer forma ou atrav&eacute;s de qualquer meio. N&atilde;o &eacute; permitida a engenharia reversa, a desmontagem ou a descompila&ccedil;&atilde;o deste programa de computador, exceto se exigido por lei para obter interoperabilidade.</p>

<h2>Isen&ccedil;&atilde;o de Garantia</h2>
<p>As informa&ccedil;&otilde;es contidas neste documento est&atilde;o sujeitas a altera&ccedil;&atilde;o sem aviso pr&eacute;vio. A Oracle Corporation n&atilde;o garante que tais informa&ccedil;&otilde;es estejam isentas de erros. Se voc&ecirc; encontrar algum erro, por favor, nos envie uma descri&ccedil;&atilde;o de tal problema por escrito.</p>

<h2>Aviso de Direitos Restritos</h2>
<p>Se este programa de computador, ou sua documenta&ccedil;&atilde;o, for entregue / distribu&iacute;do(a) ao Governo dos Estados Unidos ou a qualquer outra parte que licencie os Programas em nome daquele Governo, a seguinte nota ser&aacute; aplic&aacute;vel:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Aviso de Aplica&ccedil;&otilde;es de Risco</h2>
<p>Este programa de computador foi desenvolvido para uso em diversas aplica&ccedil;&otilde;es de gerenciamento de informa&ccedil;&otilde;es. Ele n&atilde;o foi desenvolvido nem projetado para uso em aplica&ccedil;&otilde;es inerentemente perigosas, incluindo aquelas que possam criar risco de les&otilde;es f&iacute;sicas. Se utilizar este programa em aplica&ccedil;&otilde;es perigosas, voc&ecirc; ser&aacute; respons&aacute;vel por tomar todas e quaisquer medidas apropriadas em termos de seguran&ccedil;a, backup e redund&acirc;ncia para garantir o uso seguro de tais programas de computador. A Oracle Corporation e suas afiliadas se isentam de qualquer responsabilidade por quaisquer danos causados pela utiliza&ccedil;&atilde;o deste programa de computador em aplica&ccedil;&otilde;es perigosas.</p>

<h2>Aviso de Marca Comercial</h2>
<p>Oracle e Java s&atilde;o marcas comerciais registradas da Oracle e/ou de suas empresas afiliadas. Outros nomes podem ser marcas comerciais de seus respectivos propriet&aacute;rios.</p>
<p>Intel e Intel Xeon s&atilde;o marcas comerciais ou marcas comerciais registradas da Intel Corporation. Todas as marcas comerciais SPARC s&atilde;o usadas sob licen&ccedil;a e s&atilde;o marcas comerciais ou marcas comerciais registradas da SPARC International, Inc. AMD, Opteron, o logotipo da AMD e o logotipo do AMD Opteron s&atilde;o marcas comerciais ou marcas comerciais registradas da Advanced Micro Devices. UNIX &eacute; uma marca comercial registrada licenciada por meio do cons&oacute;rcio The Open Group.</p>

<h2>Isen&ccedil;&atilde;o de Responsabilidade de Conte&uacute;dos, Produtos e Servi&ccedil;os de Terceiros</h2>
<p>Este programa ou equipamento e sua documenta&ccedil;&atilde;o podem oferecer acesso ou informa&ccedil;&otilde;es relativas a conte&uacute;dos, produtos e servi&ccedil;os de terceiros. A Oracle Corporation e suas empresas afiliadas n&atilde;o fornecem quaisquer garantias relacionadas a conte&uacute;dos, produtos e servi&ccedil;os de terceiros e est&atilde;o isentas de quaisquer responsabilidades associadas a eles, a menos que isso tenha sido estabelecido entre voc&ecirc; e a Oracle em um contrato vigente. A Oracle Corporation e suas empresas afiliadas n&atilde;o fornecem quaisquer garantias relacionadas a conte&uacute;dos, produtos e servi&ccedil;os de terceiros e est&atilde;o isentas de quaisquer responsabilidades associadas a eles, a menos que isso tenha sido estabelecido entre voc&ecirc; e a Oracle em um contrato vigente.</p>

<h2>Aviso de Documenta&ccedil;&atilde;o de Teste Alfa e Beta</h2>
<p>Se este documento estiver em status de pr&eacute;-produ&ccedil;&atilde;o:</p>
<p>Esta documenta&ccedil;&atilde;o est&aacute; em status de pr&eacute;-produ&ccedil;&atilde;o e destina-se somente a fins de demonstra&ccedil;&atilde;o e uso preliminar. Ela pode n&atilde;o ser espec&iacute;fica do equipamento (&#34;hardware&#34;) no qual voc&ecirc; est&aacute; usando o programa de computador (&#34;software&#34;). A Oracle Corporation e suas empresas afiliadas n&atilde;o fornecem quaisquer garantias relacionadas &agrave; documenta&ccedil;&atilde;o e est&atilde;o isentas de qualquer responsabilidade decorrente de perdas, despesas ou danos incorridos no uso desta documenta&ccedil;&atilde;o.</p>

<h2>Aviso de Documenta&ccedil;&atilde;o de Teste Privada Alfa e Beta</h2>
<p>Se este documento estiver em status privado de pr&eacute;-produ&ccedil;&atilde;o:</p>
<p>As informa&ccedil;&otilde;es contidas neste documento t&ecirc;m fim exclusivamente informativo e devem ser consideradas apenas na sua posi&ccedil;&atilde;o de membro do conselho consultivo do cliente ou em conformidade com o contrato de teste beta. N&atilde;o representam um compromisso de entrega de qualquer tipo de material, c&oacute;digo ou funcionalidade e n&atilde;o devem ser consideradas em decis&otilde;es de compra. O desenvolvimento, a libera&ccedil;&atilde;o e a data de disponibilidade de quaisquer recursos ou funcionalidades descritos neste documento s&atilde;o de crit&eacute;rio exclusivo da Oracle.</p>
<p>Este documento, no formato eletr&ocirc;nico ou impresso, cont&eacute;m informa&ccedil;&otilde;es de propriedade exclusivas da Oracle. O acesso e o uso deste material confidencial est&atilde;o sujeitos aos termos e condi&ccedil;&otilde;es do Contrato Master da Oracle, do Contrato de Licen&ccedil;a e Servi&ccedil;os Oracle, do Contrato de Oracle PartnerNetwork, do contrato de distribui&ccedil;&atilde;o Oracle ou outro contrato de licen&ccedil;a com a Oracle que tenha sido assinado e acordado. Este documento e as informa&ccedil;&otilde;es contidas aqui n&atilde;o podem ser divulgados, copiados, reproduzidos ou distribu&iacute;dos a qualquer pessoa fora da Oracle sem a permiss&atilde;o por escrito da Oracle. Este documento n&atilde;o faz parte do contrato de licen&ccedil;a e n&atilde;o pode ser incorporado a qualquer contrato com a Oracle ou suas subsidi&aacute;rias, ou afiliadas.</p>

<h2>Acesso &agrave; Documenta&ccedil;&atilde;o</h2>
<p>Para obter informa&ccedil;&otilde;es sobre o compromisso da Oracle com a acessibilidade, visite o site do Programa de Acessibilidade da Oracle em <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>Acesso ao Oracle Support</p>
<p>Os clientes da Oracle que adquiriram servi&ccedil;os de suporte t&ecirc;m acesso a suporte eletr&ocirc;nico por meio do My Oracle Support. Para obter informa&ccedil;&otilde;es, visite <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code> ou visite <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code> caso tenha defici&ecirc;ncia de audi&ccedil;&atilde;o.</p>


<p><img alt="Logotipo da Oracle" src="../gifs/oracle.gif"/></p>


</body></html>