<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr-CA" lang="fr-CA"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114835"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Avis%20juridiques%20d%27Oracle"></a><title>Avis juridiques d&#39;Oracle</title>
</head>
<body>
<h1>Avis juridiques d&#39;Oracle</h1>

<h2>Avis de droit d&#39;auteur</h2>
<p>Copyright &copy; 1994-2016, Oracle et/ou ses soci&eacute;t&eacute;s affili&eacute;es. Tous droits r&eacute;serv&eacute;s.</p>

<h2>Restrictions de licence/Avis de non-responsabilit&eacute; en cas de dommage indirect et/ou cons&eacute;cutif</h2>
<p>Ce logiciel et la documentation connexe sont fournis en vertu d&#39;un contrat de licence assorti de restrictions relatives &agrave; leur utilisation et divulgation. Ils sont prot&eacute;g&eacute;s en vertu des lois sur la propri&eacute;t&eacute; intellectuelle. Sauf dispositions contraires pr&eacute;vues de mani&egrave;re expresse dans votre contrat de licence ou permises par la loi,  vous ne pouvez utiliser, copier, reproduire, traduire, diffuser, modifier, mettre sous licence, transmettre, distribuer, pr&eacute;senter, effectuer, publier ni afficher &agrave; toutes fins une partie de ces derniers sous quelque forme que ce soit, par quelque moyen que ce soit. Sont interdits l&#39;ing&eacute;nierie inverse, le d&eacute;sassemblage ou la d&eacute;compilation de ce logiciel, sauf &agrave; des fins d&#39;interop&eacute;rabilit&eacute; selon les dispositions pr&eacute;vues par la loi.</p>

<h2>Exon&eacute;ration de garantie</h2>
<p>L&#39;information contenue dans les pr&eacute;sentes est sujette &agrave; changement sans pr&eacute;avis. Nous ne garantissons pas qu&#39;elle est exempte d&#39;erreur. Si vous y relevez des erreurs, veuillez nous les signaler par &eacute;crit.</p>

<h2>Avis sur la limitation des droits</h2>
<p>Si ce logiciel ou la documentation connexe sont livr&eacute;s au gouvernement des &Eacute;tats-Unis d&#39;Am&eacute;rique ou &agrave; quiconque octroyant des licences qui y sont relatives au nom du gouvernement des &Eacute;tats-Unis d&#39;Am&eacute;rique, alors la remarque suivante s&#39;applique :</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Avis sur les applications dangereuses</h2>
<p>Ce logiciel ou mat&eacute;riel informatique est destin&eacute; &agrave; un usage g&eacute;n&eacute;ral, dans diverses applications de gestion de l&#39;information. Il n&#39;a pas &eacute;t&eacute; con&ccedil;u pour &ecirc;tre utilis&eacute; dans le cadre d&#39;applications dangereuses, y compris des applications susceptibles de causer des blessures corporelles. Si vous utilisez ce logiciel ou mat&eacute;riel informatique dans des applications dangereuses, il vous revient d&#39;adopter les mesures relatives &agrave; la protection contre les interruptions, aux copies de sauvegarde et &agrave; la redondance ainsi que toute autre mesure visant &agrave; garantir son utilisation en toute s&eacute;curit&eacute;. Oracle Corporation et ses soci&eacute;t&eacute;s affili&eacute;es d&eacute;clinent toute responsabilit&eacute; relativement aux dommages pouvant r&eacute;sulter de l&#39;utilisation du logiciel ou du mat&eacute;riel informatique dans des applications dangereuses.</p>

<h2>Avis de marque de commerce</h2>
<p>Oracle et Java sont des marques de commerce enregistr&eacute;es d&#39;Oracle Corporation et/ou de ses soci&eacute;t&eacute;s affili&eacute;es. Les autres noms ou raisons sociales peuvent &ecirc;tre des marques de commerce de leurs propri&eacute;taires respectifs.</p>
<p>Intel et Intel Xeon sont des marques de commerce ou des marques de commerce enregistr&eacute;es de Intel Corporation. Toutes les marques de commerce SPARC sont utilis&eacute;es sous licence et sont des marques de commerce ou des marques de commerce enregistr&eacute;es de SPARC International, Inc. AMD, Opteron, le logo AMD et le logo AMD Opteron sont des marques de commerce ou des marques de commerce enregistr&eacute;es de Advanced Micro Devices. UNIX est une marque de commerce enregistr&eacute;e de The Open Group.</p>

<h2>Avis de non-responsabilit&eacute; concernant les services, produits et contenu tiers</h2>
<p>Ce logiciel ou mat&eacute;riel informatique et sa documentation peuvent fournir de l&#39;information au sujet de contenu, de produits et de services tiers, ou y donner acc&egrave;s. Oracle Corporation et ses soci&eacute;t&eacute;s affili&eacute;es d&eacute;clinent toute responsabilit&eacute; quant aux garanties de quelque nature que ce soit relatives au contenu, aux produits et aux services offerts par des tiers, sauf indication contraire pr&eacute;vue dans un contrat applicable entre Oracle et vous. Oracle Corporation et ses soci&eacute;t&eacute;s affili&eacute;es ne pourront &ecirc;tre tenues responsable des pertes, frais et dommages de quelque nature que ce soit d&eacute;coulant de l&#39;acc&egrave;s &agrave; du contenu, des produits ou des services tiers, ou de leur utilisation, sauf indication contraire pr&eacute;vue dans une entente applicable entre Oracle et vous.</p>

<h2>Avis de documentation pr&eacute;liminaire b&ecirc;ta et alpha</h2>
<p>Si le pr&eacute;sent document est au stade de la pr&eacute;production, la remarque suivante s&#39;applique :</p>
<p>Cette documentation est au stade de la pr&eacute;production et n&#39;est destin&eacute;e qu&#39;&agrave; des fins de d&eacute;monstration ou d&#39;utilisation pr&eacute;liminaire. Elle peut ne pas &ecirc;tre pertinente au mat&eacute;riel informatique sur lequel vous utilisez le logiciel. Oracle Corporation et ses soci&eacute;t&eacute;s affili&eacute;es d&eacute;clinent toute responsabilit&eacute; quant aux garanties de quelque nature que ce soit relatives &agrave; cette documentation et ne pourront &ecirc;tre tenues responsables des pertes, frais ou dommages de quelque nature que ce soit d&eacute;coulant de son utilisation.</p>

<h2>Avis de documentation pr&eacute;liminaire b&ecirc;ta et alpha priv&eacute;e</h2>
<p>Si le pr&eacute;sent document est au stade de la pr&eacute;production priv&eacute;e,</p>
<p>L&#39;information contenue dans ce document est fournie &agrave; titre informatif uniquement et doit &ecirc;tre prise en compte en votre qualit&eacute; de membre du comit&eacute; consultatif client, ou conform&eacute;ment &agrave; votre contrat d&#39;essai de version b&ecirc;ta uniquement. Ce document ne constitue en aucun cas un engagement &agrave; fournir des composants, du code ou des fonctionnalit&eacute;s, et ne doit pas &ecirc;tre retenu comme base pour une quelconque d&eacute;cision d&#39;achat. Le d&eacute;veloppement, la commercialisation et la mise &agrave; disposition des fonctions ou fonctionnalit&eacute;s d&eacute;crites restent &agrave; la seule discr&eacute;tion d&#39;Oracle.</p>
<p>Ce document contient des informations qui sont la propri&eacute;t&eacute; exclusive d&#39;Oracle, qu&#39;il s&#39;agisse de la version &eacute;lectronique ou imprim&eacute;e. Votre acc&egrave;s &agrave; ce contenu confidentiel et son utilisation sont soumis aux conditions de votre Contrat-cadre Oracle, de votre Contrat de Licence et de Services Oracle, de votre Contrat Partner Network Oracle, de votre contrat de distribution Oracle ou tout autre contrat de licence en vigueur que vous avez sign&eacute; et que vous vous engagez &agrave; respecter. Ce document et son contenu ne peuvent en aucun cas &ecirc;tre communiqu&eacute;s, copi&eacute;s, reproduits ou distribu&eacute;s &agrave; une personne ext&eacute;rieure &agrave; Oracle sans le consentement &eacute;crit d&#39;Oracle. Ce document ne fait pas partie de votre contrat de licence, et il ne peut &ecirc;tre int&eacute;gr&eacute; &agrave; aucun contrat contractuel pass&eacute; avec Oracle ou ses soci&eacute;t&eacute; affili&eacute;es.</p>

<h2>Accessibilit&eacute; de la documentation</h2>
<p>Pour plus d&#39;informations sur l&#39;engagement d&#39;Oracle concernant l&#39;accessibilit&eacute; &agrave; la documentation, visitez le site Web Oracle Accessibility Program, &agrave; l&#39;adresse <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>Acc&egrave;s aux services de soutien Oracle</p>
<p>Les clients Oracle ayant achet&eacute; des services de soutien ont acc&egrave;s au soutien en ligne au moyen de My Oracle Support. Pour plus d&#39;informations, visitez le site <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code> ou le site <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code> si vous &ecirc;tes malentendant.</p>


<p><img alt="Logo Oracle" src="../gifs/oracle.gif"/></p>


</body></html>