<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="cs" lang="cs"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114818"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Pr%C3%A1vn%C3%AD%20upozorn%C4%9Bn%C3%AD%20Oracle"></a><title>Pr&aacute;vn&iacute; upozorněn&iacute; Oracle</title>
</head>
<body>
<h1>Pr&aacute;vn&iacute; upozorněn&iacute; Oracle</h1>

<h2>Upozorněn&iacute; na autorsk&aacute; pr&aacute;va</h2>
<p>Copyright &copy; 1994-2016, Oracle a jej&iacute; přidružen&eacute; společnosti. V&scaron;echna pr&aacute;va vyhrazena.</p>

<h2>Odm&iacute;tnut&iacute; z&aacute;ruky u omezen&iacute; licence / odpovědnosti za n&aacute;sledn&eacute; &scaron;kody</h2>
<p>Tento software a souvisej&iacute;c&iacute; dokumentace se poskytuj&iacute; na z&aacute;kladě licenčn&iacute; smlouvy, kter&aacute; vymezuje pravidla použit&iacute; a zveřejňov&aacute;n&iacute;, a jsou chr&aacute;něny z&aacute;kony na ochranu autorsk&yacute;ch pr&aacute;v. S v&yacute;jimkou předchoz&iacute;ho v&yacute;slovn&eacute;ho povolen&iacute; v&nbsp;licenčn&iacute; smlouvě nebo v&nbsp;z&aacute;konn&eacute;m ustanoven&iacute; ž&aacute;dn&aacute; č&aacute;st softwaru ani doprovodn&eacute; dokumentace nesm&iacute; b&yacute;t použ&iacute;v&aacute;na, kop&iacute;rov&aacute;na, reprodukov&aacute;na, překl&aacute;d&aacute;na, roz&scaron;iřov&aacute;na, změněna, licencov&aacute;na, přen&aacute;&scaron;ena, distribuov&aacute;na, vystavov&aacute;na, předv&aacute;děna, publikov&aacute;na nebo zobrazov&aacute;na v&nbsp;jak&eacute;koliv formě, a pro jak&eacute;koli &uacute;čely. Je zak&aacute;z&aacute;no prov&aacute;dět zpětnou anal&yacute;zu, převod ze strojov&eacute;ho k&oacute;du nebo dekompilaci softwaru, s&nbsp;v&yacute;jimkou činnost&iacute;, kter&eacute; maj&iacute; zajistit interoperabilitu v&nbsp;souladu s&nbsp;př&iacute;slu&scaron;n&yacute;mi z&aacute;kony.</p>

<h2>Odm&iacute;tnut&iacute; z&aacute;ruky</h2>
<p>Informace obsažen&eacute; v&nbsp;tomto dokumentu mohou podl&eacute;hat změn&aacute;m bez předchoz&iacute;ho upozorněn&iacute;. Nezaručuje se, že tento dokument je bez chyb. Pokud v&nbsp;dokumentaci zjist&iacute;te chyby, oznamte n&aacute;m je pros&iacute;m p&iacute;semně.</p>

<h2>Upozorněn&iacute; na omezen&aacute; pr&aacute;va</h2>
<p>Pokud je tento software nebo souvisej&iacute;c&iacute; dokumentace dod&aacute;na vl&aacute;dě USA nebo komukoli, kdo z&iacute;sk&aacute; licenci jm&eacute;nem vl&aacute;dy USA, plat&iacute; n&aacute;sleduj&iacute;c&iacute; upozorněn&iacute;:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Upozorněn&iacute; na nebezpečn&eacute; aplikace</h2>
<p>Tento software nebo hardware byl vyvinut k&nbsp;běžn&eacute;mu použit&iacute; v&nbsp;různ&yacute;ch oblastech spr&aacute;vy informac&iacute;. Nebyl vyvinut a nen&iacute; určen pro použit&iacute; v&nbsp;oblastech, kde již z&nbsp;podstaty hroz&iacute; nebezpeč&iacute;, včetně oblast&iacute;, kde může doj&iacute;t k&nbsp;riziku zraněn&iacute; osob. Pokud tento software nebo hardware použijete v&nbsp;nebezpečn&yacute;ch situac&iacute;ch, budete zodpovědni za ve&scaron;ker&aacute; bezpečnostn&iacute;, z&aacute;ložn&iacute; a jin&aacute; opatřen&iacute;, kter&aacute; zajist&iacute; jeho bezpečn&eacute; použit&iacute;. Společnost Oracle Corporation a jej&iacute; přidružen&eacute; společnosti se zř&iacute;kaj&iacute; ve&scaron;ker&eacute; odpovědnosti za jak&eacute;koli &scaron;kody způsoben&eacute; použ&iacute;v&aacute;n&iacute;m tohoto softwaru nebo hardwaru v&nbsp;nebezpečn&yacute;ch aplikac&iacute;ch.</p>

<h2>Upozorněn&iacute; na ochrann&eacute; zn&aacute;mky</h2>
<p>Oracle a Java jsou registrovan&eacute; ochrann&eacute; zn&aacute;mky společnosti Oracle Corporation a jej&iacute;ch přidružen&yacute;ch společnost&iacute;. Dal&scaron;&iacute; n&aacute;zvy mohou b&yacute;t ochrann&yacute;mi zn&aacute;mkami př&iacute;slu&scaron;n&yacute;ch vlastn&iacute;ků.</p>
<p>Intel a Intel Xeon jsou registrovan&eacute; ochrann&eacute; zn&aacute;mky společnosti Intel Corporation. V&scaron;echny použit&eacute; ochrann&eacute; zn&aacute;mky SPARC podl&eacute;haj&iacute; licenci a jsou ochrann&eacute; zn&aacute;mky společnosti SPARC International, Inc. AMD, Opteron, logo AMD a logo AMD Opteron jsou ochrann&eacute; zn&aacute;mky nebo registrovan&eacute; ochrann&eacute; zn&aacute;mky společnosti Advanced Micro Devices. UNIX je registrovan&aacute; ochrann&aacute; zn&aacute;mka konsorcia The Open Group.</p>

<h2>Odm&iacute;tnut&iacute; odpovědnosti za obsah, produkty a služby třet&iacute;ch stran</h2>
<p>Tento software nebo hardware a dokumentace mohou umožňovat př&iacute;stup k&nbsp;obsahu, produktům či služb&aacute;m třet&iacute;ch stran nebo informace o nich. Společnost Oracle Corporation a jej&iacute; přidružen&eacute; společnosti nenesou ž&aacute;dnou odpovědnost a v&yacute;slovně odm&iacute;taj&iacute; v&scaron;echny z&aacute;ruky ve vztahu k&nbsp;obsahu, produktům či služb&aacute;m třet&iacute;ch stran, pokud v&nbsp;platn&yacute;ch smlouv&aacute;ch mezi v&aacute;mi a společnost&iacute; Oracle nen&iacute; stanoveno jinak. Společnost Oracle Corporation a jej&iacute; přidružen&eacute; společnosti nejsou odpovědn&eacute; za jak&eacute;koli ztr&aacute;ty, n&aacute;klady nebo &scaron;kody, kter&eacute; vzniknou v&nbsp;důsledku př&iacute;stupu k&nbsp;obsahu, produktům či služb&aacute;m třet&iacute;ch stran nebo jejich použ&iacute;v&aacute;n&iacute;m, s&nbsp;v&yacute;jimkou př&iacute;padů stanoven&yacute;ch v&nbsp;platn&yacute;ch smlouv&aacute;ch mezi V&aacute;mi a společnost&iacute; Oracle.</p>

<h2>Upozorněn&iacute; na alfa a beta verzi konceptu dokumentace</h2>
<p>Pokud se jedn&aacute; o předběžnou dokumentaci:</p>
<p>Tato dokumentace je předběžn&aacute; a je určena pouze pro uk&aacute;zku a předběžn&eacute; použit&iacute;. Je možn&eacute;, že se nevztahuje př&iacute;mo k&nbsp;hardwaru, na kter&eacute;m použ&iacute;v&aacute;te software. Společnost Oracle Corporation a jej&iacute; přidružen&eacute; společnosti nenesou ž&aacute;dnou odpovědnost a v&yacute;slovně odm&iacute;taj&iacute; v&scaron;echny z&aacute;ruky ve vztahu k&nbsp;t&eacute;to dokumentaci a nejsou odpovědn&eacute; za jak&eacute;koli ztr&aacute;ty, n&aacute;klady nebo &scaron;kody, kter&eacute; vzniknou v&nbsp;důsledku použ&iacute;v&aacute;n&iacute; t&eacute;to dokumentace.</p>

<h2>Soukrom&eacute; upozorněn&iacute; na alfa a beta verzi konceptu dokumentace</h2>
<p>Pokud se jedn&aacute; o předběžnou soukromou dokumentaci:</p>
<p>Informace obsažen&eacute; v&nbsp;tomto dokumentu slouž&iacute; pouze k&nbsp;informativn&iacute;m &uacute;čelům, kter&eacute; byste měli zv&aacute;žit z&nbsp;hlediska sv&eacute;ho postaven&iacute; člena poradn&iacute;ho v&yacute;boru z&aacute;kazn&iacute;ků nebo na z&aacute;kladě sv&eacute; smlouvy pro zku&scaron;ebn&iacute; použit&iacute; beta verz&iacute;. Tento dokument nepředstavuje z&aacute;vazek k&nbsp;dod&aacute;n&iacute; jak&eacute;hokoli materi&aacute;lu, k&oacute;du nebo funkčnosti a nelze se na něj spol&eacute;hat při tvorbě n&aacute;kupn&iacute;ch rozhodnut&iacute;. V&yacute;voj, vyd&aacute;n&iacute; a napl&aacute;nov&aacute;n&iacute; jak&yacute;chkoli funkc&iacute; popisovan&yacute;ch v&nbsp;tomto dokumentu zůst&aacute;v&aacute; v&yacute;hradně na uv&aacute;žen&iacute; společnosti Oracle.</p>
<p>Tento dokument v&nbsp;jak&eacute;koli podobě, elektronick&eacute; či ti&scaron;těn&eacute;, obsahuje informace ve v&yacute;hradn&iacute;m vlastnictv&iacute; společnosti Oracle. V&aacute;&scaron; př&iacute;stup a použ&iacute;v&aacute;n&iacute; tohoto důvěrn&eacute;ho materi&aacute;lu se ř&iacute;d&iacute; podm&iacute;nkami va&scaron;&iacute; smlouvy Oracle Master Agreement, licenčn&iacute; a servisn&iacute; smlouvy se společnost&iacute; Oracle, smlouvy Oracle PartnerNetwork Agreement, distribučn&iacute; smlouvy se společnost&iacute; Oracle nebo jin&yacute;ch licenčn&iacute;ch smluv, kter&eacute; jste přijali a vyj&aacute;dřili jste s&nbsp;nimi souhlas. Tento dokument a informace v&nbsp;něm obsažen&eacute; nemohou b&yacute;t sdělov&aacute;ny, kop&iacute;rov&aacute;ny, reprodukov&aacute;ny nebo distribuov&aacute;ny mimo společnost Oracle bez předchoz&iacute;ho p&iacute;semn&eacute;ho souhlasu společnosti Oracle. Tento dokument nen&iacute; souč&aacute;st&iacute; va&scaron;&iacute; licenčn&iacute; smlouvy ani jej nelze začlenit do ž&aacute;dn&eacute;ho smluvn&iacute;ho ujedn&aacute;n&iacute; se společnost&iacute; Oracle, jej&iacute;ch podř&iacute;zen&yacute;ch jednotek nebo jej&iacute;ch přidružen&yacute;ch společnost&iacute;.</p>

<h2>Př&iacute;stupnost dokumentace</h2>
<p>Informace o usnadněn&iacute; př&iacute;stupu k&nbsp;produktům společnosti Oracle najdete na webu Oracle Accessibility Program na adrese <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>Př&iacute;stup k&nbsp;technick&eacute; podpoře společnosti Oracle</p>
<p>Z&aacute;kazn&iacute;ci společnosti Oracle, kteř&iacute; si zakoupili technickou podporu, maj&iacute; př&iacute;stup k&nbsp;elektronick&eacute; podpoře prostřednictv&iacute;m webu My Oracle Support Dal&scaron;&iacute; informace najdete na webu <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code>. Osoby se sluchov&yacute;m postižen&iacute;m najdou dal&scaron;&iacute; informace na adrese <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code>.</p>


<p><img alt="Logo Oracle" src="../gifs/oracle.gif"/></p>


</body></html>