<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="pt" lang="pt"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114853"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Avisos%20Legais%20da%20Oracle"></a><title>Avisos Legais da Oracle</title>
<link rel="stylesheet" href="../css/blafdoc.css" type="text/css"/>
</head>
<body>
<h1>Avisos Legais da Oracle</h1>

<h2>Aviso de Copyright</h2>
<p>Copyright &copy; 1994-2016, Oracle e/ou respetivas filiais. Todos os direitos reservados.</p>

<h2>Limita&ccedil;&atilde;o de Responsabilidade de Danos Consequentes/Garantia de Restri&ccedil;&otilde;es da Licen&ccedil;a</h2>
<p>O presente software e respetiva documenta&ccedil;&atilde;o s&atilde;o fornecidos ao abrigo de um acordo de licenciamento que cont&eacute;m restri&ccedil;&otilde;es relativas &agrave; utiliza&ccedil;&atilde;o e divulga&ccedil;&atilde;o dos mesmos e est&atilde;o protegidos por leis de propriedade intelectual. Salvo disposi&ccedil;&atilde;o expressa no acordo de licenciamento ou se estipulado por lei, nenhuma parte dos mesmos pode ser utilizada, copiada, reproduzida, traduzida, difundida, modificada, licenciada, transmitida, distribu&iacute;da, exibida, executada, publicada ou apresentada sob qualquer forma ou por qualquer meio. &Eacute; proibida a realiza&ccedil;&atilde;o de engenharia reversa, descodifica&ccedil;&atilde;o e/ou descompila&ccedil;&atilde;o do presente software, exceto se estipulado por lei para fins de interoperabilidade.</p>

<h2>Limita&ccedil;&atilde;o de Responsabilidade da Garantia</h2>
<p>As informa&ccedil;&otilde;es contidas no presente documento est&atilde;o sujeitas a altera&ccedil;&otilde;es sem aviso pr&eacute;vio e n&atilde;o &eacute; garantida a isen&ccedil;&atilde;o de erros nas mesmas. Se detetar quaisquer erros, agradecemos que nos seja efetuada a comunica&ccedil;&atilde;o dos mesmos por escrito.</p>

<h2>Aviso de Direitos Restritos</h2>
<p>Se o presente software ou a documenta&ccedil;&atilde;o relacionada com o mesmo forem fornecidos ao Governo dos Estados Unidos da Am&eacute;rica ou a terceiros aos quais tenha sido concedida licen&ccedil;a em nome do Governo dos Estados Unidos da Am&eacute;rica, aplica-se o seguinte aviso:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Aviso de Aplica&ccedil;&otilde;es Perigosas</h2>
<p>O presente software ou hardware foi desenvolvido para utiliza&ccedil;&atilde;o geral em diversas aplica&ccedil;&otilde;es de gest&atilde;o de informa&ccedil;&otilde;es. O software ou hardware n&atilde;o foi desenvolvido para, nem tem como finalidade, a utiliza&ccedil;&atilde;o em quaisquer aplica&ccedil;&otilde;es inerentemente perigosas, incluindo aplica&ccedil;&otilde;es que possam criar riscos de danos pessoais. Se o presente software ou hardware for utilizado em aplica&ccedil;&otilde;es perigosas, &eacute; da responsabilidade do utilizador tomar todas as medidas apropriadas de prote&ccedil;&atilde;o contra falhas, de cria&ccedil;&atilde;o de c&oacute;pias de seguran&ccedil;a, de redund&acirc;ncia e outras para garantir a utiliza&ccedil;&atilde;o segura do presente software ou hardware. A Oracle Corporation e respetivas filiais excluem toda e qualquer responsabilidade pelos danos causados pela utiliza&ccedil;&atilde;o do presente software ou hardware em aplica&ccedil;&otilde;es perigosas.</p>

<h2>Aviso da Marca Comercial</h2>
<p>Oracle e Java s&atilde;o marcas registadas da Oracle e/ou das respetivas filiais. Outros nomes poder&atilde;o ser marcas comerciais dos respetivos propriet&aacute;rios.</p>
<p>Intel e Intel Xeon s&atilde;o marcas comerciais ou marcas registadas da Intel Corporation. Todas as marcas comerciais SPARC s&atilde;o utilizadas sob licen&ccedil;a e s&atilde;o marcas comerciais ou marcas registadas da SPARC International, Inc. AMD, Opteron, o log&oacute;tipo AMD e o log&oacute;tipo AMD Opteron s&atilde;o marcas comerciais ou marcas registadas da Advanced Micro Devices. UNIX &eacute; uma marca registada de The Open Group.</p>

<h2>Limita&ccedil;&atilde;o de Responsabilidade de Conte&uacute;dos, Produtos e Servi&ccedil;os de Terceiros</h2>
<p>O presente software ou hardware e respetiva documenta&ccedil;&atilde;o poder&atilde;o fornecer acesso a ou informa&ccedil;&otilde;es acerca de conte&uacute;dos, produtos e servi&ccedil;os de terceiros. A Oracle Corporation e respetivas filiais n&atilde;o se responsabilizam por, e excluem expressamente quaisquer tipos de garantias relativas a conte&uacute;dos, produtos e servi&ccedil;os fornecidos por terceiros, salvo se estabelecido expressamente em contr&aacute;rio num acordo aplic&aacute;vel entre o Cliente e a Oracle. A Oracle Corporation e respetivas filiais excluem todas e quaisquer responsabilidades por perdas, custos ou danos em que o utilizador possa incorrer devido ao acesso a ou &agrave; utiliza&ccedil;&atilde;o de conte&uacute;dos, produtos ou servi&ccedil;os de terceiros, exceto se estabelecido expressamente num acordo aplic&aacute;vel entre o Cliente e a Oracle.</p>

<h2>Aviso de Documenta&ccedil;&atilde;o Provis&oacute;rio Alfa e Beta</h2>
<p>Caso este documento se encontre em estado de pr&eacute;-produ&ccedil;&atilde;o:</p>
<p>Esta documenta&ccedil;&atilde;o encontra-se em estado de pr&eacute;-produ&ccedil;&atilde;o e serve apenas para efeitos de demonstra&ccedil;&atilde;o e utiliza&ccedil;&atilde;o preliminar. Poder&aacute; n&atilde;o ser espec&iacute;fica do hardware no qual est&aacute; a utilizar o software. A Oracle Corporation e respetivas filiais n&atilde;o se responsabilizam por, e excluem expressamente todos e quaisquer tipos de garantias relacionadas com a presente documenta&ccedil;&atilde;o e excluem todas e quaisquer responsabilidades por perdas, custos ou danos em que o utilizador possa incorrer devido &agrave; utiliza&ccedil;&atilde;o desta documenta&ccedil;&atilde;o.</p>

<h2>Aviso de Documenta&ccedil;&atilde;o Provis&oacute;rio Alfa e Beta Privado</h2>
<p>Caso este documento se encontre em estado de pr&eacute;-produ&ccedil;&atilde;o privado:</p>
<p>As informa&ccedil;&otilde;es contidas no presente documento destinam-se apenas a fins de partilha de informa&ccedil;&atilde;o e s&oacute; dever&atilde;o ser consultadas pelo utilizador enquanto membro do conselho consultivo ou em conformidade com o respetivo acordo experimental beta. O presente documento n&atilde;o constitui um compromisso de entrega de material, c&oacute;digo ou funcionalidade e n&atilde;o dever&aacute; ser levado em considera&ccedil;&atilde;o para efeitos de tomada de decis&otilde;es de compra. O desenvolvimento, lan&ccedil;amento e calendariza&ccedil;&atilde;o de quaisquer caracter&iacute;sticas ou funcionalidades descritas neste documento s&atilde;o da exclusiva responsabilidade da Oracle.</p>
<p>O presente documento, independentemente da forma na qual seja apresentado, software ou material impresso, cont&eacute;m informa&ccedil;&otilde;es protegidas por direitos de propriedade intelectual, que s&atilde;o propriedade exclusiva da Oracle. O acesso e a respetiva utiliza&ccedil;&atilde;o deste material confidencial por parte do utilizador est&aacute; sujeita aos respetivos termos e condi&ccedil;&otilde;es do Acordo Quadro Oracle, do Acordo de Licenciamento e Servi&ccedil;os Oracle, do Acordo do Oracle PartnerNetwork, do acordo de distribui&ccedil;&atilde;o Oracle ou outro acordo de licenciamento que foi executado entre o Cliente e a Oracle e com o qual o Cliente concorda em agir em conformidade. O presente documento e as informa&ccedil;&otilde;es nele contidas n&atilde;o podem ser divulgadas, copiadas, reproduzidas ou distribu&iacute;das a entidades externas &agrave; Oracle sem o consentimento pr&eacute;vio por escrito por parte da Oracle. O presente documento n&atilde;o constitui parte integrante do acordo de licenciamento do utilizador nem poder&aacute; ser incorporado em nenhum acordo contratual com a Oracle ou respetivas subsidi&aacute;rias ou filiais.</p>

<h2>Acesso a Documenta&ccedil;&atilde;o</h2>
<p>Para obter informa&ccedil;&otilde;es sobre o compromisso da Oracle com a acessibilidade, visite o local na Web do Programa de Acessibilidade da Oracle <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>Acesso ao Suporte Oracle</p>
<p>Os clientes Oracle que tenham adquirido previamente suporte, t&ecirc;m acesso ao suporte eletr&oacute;nico atrav&eacute;s do My Oracle Support. Para mais informa&ccedil;&otilde;es, visite <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code> ou <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code> se tiver problemas auditivos.</p>


<p><img alt="Log&oacute;tipo da Oracle" src="../gifs/oracle.gif"/></p>


</body></html>