<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="da" lang="da"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114819"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Oracle%20Legal%20Notices"></a><title>Oracle Legal Notices</title>
<link rel="stylesheet" href="../css/blafdoc.css" type="text/css"/>
</head>
<body>
<h1>Oracle Legal Notices</h1>

<h2>Besked om copyright</h2>
<p>Copyright &copy; 1994-2016, Oracle og/eller Oracles associerede selskaber. Alle rettigheder forbeholdes.</p>

<h2>Licensbegr&aelig;nsninger og ansvarsfraskrivelse vedr. garanti/f&oslash;lgeskader</h2>
<p>Dette computer programmel og tilh&oslash;rende dokumentation er underlagt en licensaftale, der indeholder begr&aelig;nsninger for anvendelse og regler om fortrolighed, og er beskyttet af immaterialretlige lovregler. Medmindre andet udtrykkeligt er angivet i licensaftalen eller f&oslash;lger af ufravigelig lovgivning, m&aring; ingen del af dette softwareprogram anvendes, kopieres, reproduceres, overs&aelig;ttes, videreformidles, transmitteres, fremf&oslash;res, &aelig;ndres, licensieres, distribueres, udstilles, offentligg&oslash;res eller vises helt eller delvist i nogen form eller p&aring; nogen m&aring;de, elektronisk eller mekanisk, til noget som helst form&aring;l. Bearbejdelse med sigte p&aring; at rekonstruere kildekoden (&#34;reverse engineering&#34;), demontering eller dekompilering af programmellet, er ikke tilladt, medmindre det er n&oslash;dvendigt for at opn&aring; interoperabilitet og f&oslash;lger af ufravigelig lovgivning.</p>

<h2>Ansvarsfraskrivelse vedr. garanti</h2>
<p>Oplysningerne i n&aelig;rv&aelig;rende dokument kan &aelig;ndres uden forudg&aring;ende varsel. Vi tager forbehold for fejl i n&aelig;rv&aelig;rende dokument. S&aring;fremt der er kommentarer til n&aelig;rv&aelig;rende dokument, bedes disse fremsendt skriftligt til os.</p>

<h2>Besked vedr. begr&aelig;nsede rettigheder</h2>
<p>Hvis softwareprogrammet eller tilh&oslash;rende dokumentation leveres til den amerikanske regering eller til nogen, der har licensieret eller anvender det p&aring; vegne af den amerikanske regering, s&aring; er f&oslash;lgende meddelelse g&aelig;ldende:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &#34;commercial computer software&#34; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Besked vedr. anvendelser forbundet med iboende fare</h2>
<p>Softwareprogrammet eller hardwaren er udviklet til almindelig anvendelse i forskellige informationsstyringsprogrammer. Softwareprogrammet eller hardwaren er ikke udviklet eller beregnet til anvendelse i programmer, der er forbundet med en iboende fare, herunder anvendelser der kan for&aring;rsage personskade. Det er licenstagers ansvar at tage alle passende sikkerhedsforanstaltninger, back-up og forholdsregler for at sikre en sikker anvendelse af softwareprogrammet eller hardwaren, hvis dette bruges til s&aring;danne form&aring;l. Oracle Corporation og/eller Oracle Corporations associerede selskaber p&aring;tager sig intet ansvar for nogen skade, der m&aring;tte v&aelig;re for&aring;rsaget af en s&aring;dan anvendelse af softwareprogrammet eller hardwaren.</p>

<h2>Besked om varem&aelig;rker</h2>
<p>Oracle og Java er registrerede varem&aelig;rker tilh&oslash;rende Oracle og/eller Oracles associerede selskaber. Andre navne kan v&aelig;re varem&aelig;rker tilh&oslash;rende de respektive ejere.</p>
<p>Intel og IntelXeon er varem&aelig;rker eller registrerede varem&aelig;rker tilh&oslash;rende Intel Corporation. Alle SPARC varem&aelig;rker er underlagt licensaftale og er registrerede varem&aelig;rker tilh&oslash;rende SPARC International, Inc. AMD, Opteron, AMD-logoet og AMD Opteron-logoet er varem&aelig;rker eller registrerede varem&aelig;rker tilh&oslash;rende Advanced Micro Devices.  UNIX er et registreret varem&aelig;rke tilh&oslash;rende The Open Group.</p>

<h2>Ansvarsfraskrivelse vedr. tredjepartindhold, produkter og servicer</h2>
<p>Dette softwareprogram eller hardware og tilh&oslash;rende dokumentation kan give adgang til eller indeholde oplysninger om indhold, produkter og ydelser fra tredjeparter. Oracle Corporation og/eller Oracle Corporations associerede selskaber er ikke ansvarlig for og yder ingen garanti af nogen art hvad ang&aring;r indhold, produkter og ydelser fra tredjeparter med mindre andet er anf&oslash;rt i g&aelig;ldende aftale mellem dig og Oracle. Oracle Corporation og/eller Oracle Corporations associerede selskaber p&aring;tager sig intet ansvar for noget tab eller nogen omkostninger eller skader, der opst&aring;r som f&oslash;lge af adgang til eller brug af indhold, produkter eller ydelser fra tredjeparter, med mindre andet er anf&oslash;rt i g&aelig;ldende aftale mellem dig og Oracle.</p>

<h2>Besked om dokumentation til alfa- og betaudkast</h2>
<p>Hvis dette dokument er forel&oslash;bigt:</p>
<p>Dokumentationen skal betragtes som forel&oslash;big og er kun beregnet til demonstration og midlertidig brug. N&aelig;rv&aelig;rende dokumentation er ikke n&oslash;dvendigvis lavet specifikt for den hardware, som De bruger softwareprogrammet p&aring;. Oracle Corporation og/eller Oracle Corporations associerede selskaber er ikke ansvarlig for og yder ingen garanti hvad ang&aring;r denne dokumentation og er ikke ansvarlige for noget tab eller nogen omkostninger eller skader, der opst&aring;r som f&oslash;lge af anvendelsen af n&aelig;rv&aelig;rende dokumentation.</p>

<h2>Besked om privat dokumentation til alfa- og betaudkast</h2>
<p>Hvis dette dokument er privat forel&oslash;bigt:</p>
<p>Form&aring;let med oplysningerne i n&aelig;rv&aelig;rende dokument er alene informationsdeling og skal alene betragtes ud fra din rolle som medlem af et r&aring;dgivende kundepanel eller i henhold til din beta-testaftale. Det er ikke en forpligtelse til at levere materiale, kode eller funktionalitet og kan ikke l&aelig;gges til grund for k&oslash;bsbeslutninger. Oracle forbeholder sig retten til alene og efter eget sk&oslash;n at &aelig;ndre udviklingen af og tidspunktet for udgivelse af funktioner og funktionalitet, der beskrives in n&aelig;rv&aelig;rende dokument.</p>
<p>N&aelig;rv&aelig;rende dokument indeholder uanset i hvilken form det forekommer (softwareprogram eller trykt materiale) ophavsretlige og patentbeskyttede oplysninger, som udelukkende tilh&oslash;rer Oracle. Adgang til og anvendelse af n&aelig;rv&aelig;rende fortrolige materiale er underlagt vilk&aring;rene og betingelserne i Oracle Master Agreement, Oracle License and Services Agreement, Oracle PartnerNetwork Agreement, Oracle Distribution Agreement, eller andre licensaftaler, som er indg&aring;et mellem dig og Oracle, og som du accepterer at overholde. N&aelig;rv&aelig;rende dokument og oplysningerne heri m&aring; ikke offentligg&oslash;res, kopieres, reproduceres eller distribueres til personer uden for Oracle uden Oracles forudg&aring;ende skriftlige samtykke. N&aelig;rv&aelig;rende dokument er ikke en del af din licensaftale og kan ikke indg&aring; i nogen kontraktm&aelig;ssig aftale med Oracle og/eller Oracles associerede selskaber.</p>

<h2>Documentation Accessibility</h2>
<p>For oplysninger om Oracles initiativer om tilg&aelig;ngelighed henvises til Oracle Accessibility Program website <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>Adgang til Oracle Support</p>
<p>Oracle kunder, der har k&oslash;bt support, har adgang til elektronisk support via My Oracle Support. For oplysninger henvises til <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code> eller <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code> hvis du er h&oslash;reh&aelig;mmet.</p>


<p><img alt="Oracle-logo" src="../gifs/oracle.gif"/></p>


</body></html>