<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv"><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"/>
<a class="dashingAutolink" name="autolink-114863"></a><a class="dashAnchor" name="//apple_ref/cpp/Package/Juridiska%20meddelanden%20fr%C3%A5n%20Oracle"></a><title>Juridiska meddelanden fr&aring;n Oracle</title>
<link rel="stylesheet" href="../css/blafdoc.css" type="text/css"/>
</head>
<body>
<h1>Juridiska meddelanden fr&aring;n Oracle</h1>

<h2>Copyrightmeddelande</h2>
<p>Copyright &copy; 1994-2016, Oracle och/eller dess dotterbolag. Oracle f&ouml;rbeh&aring;ller sig samtliga r&auml;ttigheter.</p>

<h2>Garanti f&ouml;r licensbegr&auml;nsningar/friskrivningsklausul f&ouml;r f&ouml;ljdskador</h2>
<p>Programvaran och dess relaterade dokumentation tillhandah&aring;lls under ett licensavtal som inneh&aring;ller begr&auml;nsningar r&ouml;rande anv&auml;ndning och redovisning, och skyddas av immaterialr&auml;ttslagar. Med undantag f&ouml;r vad som uttryckligen till&aring;ts i licensavtalet eller till&auml;mpliga lagar, &auml;r det inte till&aring;tet att anv&auml;nda, kopiera, reproducera, &ouml;vers&auml;tta, uts&auml;nda, modifiera, underlicensiera, &ouml;verf&ouml;ra, distribuera, visa offentligt, uppf&ouml;ra, publicera eller visa n&aring;gon del, i n&aring;gon form, eller med n&aring;gra medel. Det &auml;r inte till&aring;tet att bakl&auml;ngeskonstruera, demontera eller dekompilera programvaran, om det inte uttryckligen till&aring;ts f&ouml;r integration enligt lagstiftning.</p>

<h2>Garantifriskrivningsklausul</h2>
<p>Informationen som anges h&auml;r kan &auml;ndras utan f&ouml;reg&aring;ende meddelande, och garanteras inte vara felfri. Om du hittar fel, rapportera dem till oss skriftligen.</p>

<h2>Information om begr&auml;nsade r&auml;ttigheter</h2>
<p>Om programmet eller dess tillh&ouml;rande dokumentation levereras till amerikansk myndighet (US Government) eller om n&aring;gon uppl&aring;ter eller anv&auml;nder programmen f&ouml;r amerikansk myndighets r&auml;kning g&auml;ller f&ouml;ljande:</p>
<p>U.S. GOVERNMENT END USERS: Oracle programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, delivered to U.S. Government end users are &ldquo;commercial computer software&rdquo; pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, use, duplication, disclosure, modification, and adaptation of the programs, including any operating system, integrated software, any programs installed on the hardware, and/or documentation, shall be subject to license terms and license restrictions applicable to the programs. No other rights are granted to the U.S. Government.</p>

<h2>Information om farlig verksamhet</h2>
<p>Programmet eller maskinvaran &auml;r avsett f&ouml;r generell anv&auml;ndning i en m&auml;ngd olika informationshanteringsprogram. Det &auml;r inte utvecklat f&ouml;r eller avsett f&ouml;r anv&auml;ndning som till sin natur &auml;r att anses som farlig, inklusive verksamheter som kan orsaka risk f&ouml;r personskada. Vid anv&auml;ndning av programmet eller maskinvaran i farlig verksamhet &auml;r det licenstagarens eget ansvar att vidta alla s&auml;kerhets&aring;tg&auml;rder f&ouml;r anv&auml;ndning av programmen f&ouml;r s&aring;dana syften. Oracle Corporation och dess dotterbolag fr&aring;ns&auml;ger sig allt ansvar f&ouml;r skador som uppkommer vid anv&auml;ndning av programmet eller maskinvaran i s&aring;dan farlig verksamhet.</p>

<h2>Information om varum&auml;rkesskydd</h2>
<p>Oracle och Java &auml;r registrerade varum&auml;rken tillh&ouml;rande Oracle och/eller dess dotterbolag. &Ouml;vriga namn kan vara varum&auml;rken som tillh&ouml;r respektive f&ouml;retag.</p>
<p>Intel och Intel Xeon &auml;r varum&auml;rken eller registrerade varum&auml;rken tillh&ouml;rande Intel Corporation. Alla SPARC-varum&auml;rken anv&auml;nds under licens och &auml;r varum&auml;rken eller registrerade varum&auml;rken tillh&ouml;rande SPARC International, Inc. AMD, Opteron, AMD-logotypen samt AMD Opteron-logotypen &auml;r varum&auml;rken eller registrerade varum&auml;rken tillh&ouml;rande Advanced Micro Devices. UNIX &auml;r ett registrerat varum&auml;rke tillh&ouml;rande The Open Group.</p>

<h2>Friskrivningsklausul f&ouml;r inneh&aring;ll, produkter och tj&auml;nster fr&aring;n tredje part</h2>
<p>Programmet, h&aring;rdvaran och dess tillh&ouml;rande dokumentation kan ge &aring;tkomst till inneh&aring;ll, produkter och tj&auml;nster fr&aring;n tredje part. Oracle Corporation och dess dotterbolag &auml;r inte ansvarigt f&ouml;r och fr&aring;ns&auml;ger sig uttryckligen allt ansvar med avseende p&aring; inneh&aring;ll, produkter och tj&auml;nster fr&aring;n tredje part om inte n&aring;got annat har angetts i ett till&auml;mpligt avtal mellan dig och Oracle. Oracle Corporation och dess dotterbolag ansvarar inte f&ouml;r f&ouml;rlust, kostnader eller skada av n&aring;got slag som kan uppkomma fr&aring;n &aring;tkomst eller anv&auml;ndning av inneh&aring;ll, produkter eller tj&auml;nster fr&aring;n tredje part f&ouml;rutom vad som har angetts i ett till&auml;mpligt avtal mellan dig och Oracle.</p>

<h2>Meddelande om dokumentation f&ouml;r alfa- och betautkast</h2>
<p>Om det h&auml;r dokumentet &auml;r en f&ouml;rhandsversion:</p>
<p>Dokumentationen &auml;r en f&ouml;rhandsversion endast avsedd f&ouml;r demonstration och tillf&auml;llig anv&auml;ndning. Den kanske inte &auml;r specifik f&ouml;r maskinvaran som du anv&auml;nder programvaran p&aring;. Oracle Corporation och dess dotterbolag ansvarar inte f&ouml;r och garanterar inte inneh&aring;llet i dokumentationen, och ansvarar heller inte f&ouml;r f&ouml;rluster, kostnader eller skador som uppst&aring;r till f&ouml;ljd av anv&auml;ndning av denna dokumentation.</p>

<h2>Meddelande om dokumentation f&ouml;r privata alfa- och betautkast</h2>
<p>Om det h&auml;r dokumentet &auml;r en privat f&ouml;rhandsversion:</p>
<p>Informationen i det h&auml;r dokumentet g&auml;ller endast i informationssyfte, och ska endast v&auml;rderas av dig som medlem i en Customer Advisory Board eller i enlighet med ditt Betatestavtal. Det &auml;r inget &aring;tagande att leverera n&aring;gon form av material, kod eller funktion, och ska inte fungera som underlag vid k&ouml;p. Oracle f&ouml;rbeh&aring;ller sig r&auml;tten, enligt eget gottfinnande, att &auml;ndra utvecklingen av och tidpunkten f&ouml;r utgivandet av de funktioner och speciella egenskaper som beskrivs i det h&auml;r dokumentet.</p>
<p>Det h&auml;r dokumentet, oavsett i vilken form det f&ouml;rekommer (programvara eller tryckt material), inneh&aring;ller upphovsr&auml;tts och patentskyddad information som tillh&ouml;r Oracle. &Aring;tkomsten till och anv&auml;ndningen av det h&auml;r konfidentiella materialet &auml;r f&ouml;rem&aring;l f&ouml;r villkoren i Oracle Master Agreement, Oracle License and Services Agreement, Oracle PartnerNetwork Agreement, distributionsavtal f&ouml;r Oracle, eller annat licensavtal som har ing&aring;tts av dig och Oracle och som du samtycker att f&ouml;lja. Det h&auml;r dokumentet och dess information f&aring;r inte visas f&ouml;r, kopieras, reproduceras eller distribueras till n&aring;gon utanf&ouml;r Oracle utan skriftlig till&aring;telse fr&aring;n Oracle. Det h&auml;r dokumentet &auml;r inte en del av ditt licensavtal och kan inte ing&aring; i ett avtal med Oracle och/eller dess dotterbolag.</p>

<h2>Dokumenthj&auml;lpmedel</h2>
<p>F&ouml;r information om Oracles &aring;tagande ang&aring;ende hj&auml;lpmedel, bes&ouml;k Oracles webbplats f&ouml;r hj&auml;lpmedelsfunktioner: <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=docacc</a></code>.</p>
<p>&Aring;tkomst till Oracle Support</p>
<p>Oracles kunder som har k&ouml;pt support har tillg&aring;ng till elektronisk support via My Oracle Support. F&ouml;r mer information bes&ouml;k <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=info</a></code> eller <code><a href="http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs">http://www.oracle.com/pls/topic/lookup?ctx=acc&amp;id=trs</a></code> om du &auml;r h&ouml;rselskadad.</p>


<p><img alt="Oracles logotyp" src="../gifs/oracle.gif"/></p>


</body></html>